{
  "ID": "azure_network_watcher_enabled",
  "Title": "Ensure that Network Watcher is 'Enabled'",
  "Description": "Enable Network Watcher for Azure subscriptions.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_location",
      "azure_network_watcher",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_location",
    "QueryToExecute": "select\n  loc.id resource,\n  loc.kaytu_account_id as kaytu_account_id,\n  loc.kaytu_resource_id as kaytu_resource_id,\n  case\n    when watcher.id is null then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when watcher.id is null then 'Network watcher not enabled in ' || loc.name || '.'\n    else 'Network watcher enabled in ' || loc.name || '.'\n  end as reason,\n  loc.name\n  \n  \n  , sub.display_name as subscription\nfrom\n  azure_location loc\n  left join azure_network_watcher watcher on watcher.region = loc.name\n  join azure_subscription sub on sub.subscription_id = loc.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "6.5"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "6"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Network"
    ],
    "x-kaytu-explanation": [
      "AWS Control specifies Amazon Web Services control, and the request you mentioned refers to Azure, which is a product of Microsoft, another cloud service provider. However, assuming there's a confusion about the cloud service provider, here's an explanation referring to Azure Network Watcher:\n\nAzure Network Watcher is a service that monitors and diagnoses your network performance and health. It provides tools to monitor, diagnose, view metrics, and enable or disable logs for resources in an Azure virtual network.\n\nHere's how you can enable Network Watcher in Azure through Azure CLI:\n\n**Step #1: Prerequisites**\n\n- Install Azure CLI.\n- Sign in to Azure from the Azure CLI.\n\n**Step #2: Enable Network Watcher for Azure subscriptions**\n\n**Step 2.1:** Open the shell/terminal, and run the command:\n\n```shell\naz network watcher configure --state Enabled --resource-group MyResourceGroup --location eastus\n```\n\n**Explanation:**\n\n- `az network watcher configure`: This is the command to configure network watcher.\n- `--state Enabled`: This enables the network watcher.\n- `--resource-group MyResourceGroup`: Replace `MyResourceGroup` with the name of your resource group.\n- `--location eastus`: Replace `eastus` with the location of the resource group.\n\nPlease remember to replace MyResourceGroup and eastus with your desired resource group and location respectively. \n\nThis will enable Azure Network Watcher for the specified Azure subscriptions. \n\nFor executing this, you need to have necessary permissions to make changes to your Azure subscription."
    ],
    "x-kaytu-noncompliance-cost": [
      "Despite this AWS control being related to Microsoft Azure, it's intended to ensure that active monitoring and diagnostics of the network health and performance are in place. However, if an entity fails to comply with this control, they might face several costs, including:\n\n1. **Increased Security Risks:** Without Network Watcher, the organization could be exposed to more security vulnerabilities as they cannot continually monitor and diagnose their Azure instances. This could lead to unauthorized access, data breaches, or leakage of sensitive information.\n\n2. **Performance Issues:** Without adequate monitoring, performance issues might not be detected early, which could affect the quality of service and amount to financial losses.\n\n3. **Increased Time to Detect and Resolve Issues:** Without Network watcher, it might take longer to detect and diagnose problems in your network, increasing the time and cost to resolve them. \n\n4. **Potential Non-compliance with Audit Requirements:** If Network Watcher is a requirement in compliance audit requirements (such as PCI DSS, HIPAA, or GDPR), your organization might face penalties, fines, and damage to your reputation.\n\n5. **Increased Operational Costs:** The lack of insight into network performance means that you cannot efficiently manage and use Azure resources. This can lead to increased operational costs.\n\n6. **Possible Loss of Customer Trust:** If a data breach occurs or your service quality deteriorates due to poor network performance, this can lead to a loss of customer trust, leading to loss of revenue in the long run."
    ],
    "x-kaytu-usefulness-example": [
      "Enabling Network Watcher for Azure subscriptions is actually not related to AWS (Amazon Web Services), but rather, it pertains to the Microsoft Azure cloud computing platform. Nevertheless, here is an instance of its usefulness:\n\n**Example: Network Troubleshooting and Performance Monitoring**\n\nSuppose you are a system administrator for a large corporation and manage a sizable network of resources in Azure. Recently, the users have been mentioning that it's taking a long time for them to access the services. \n\nIn this case, the Azure Network Watcher can come in quite handy. By turning it on, the Network Watcher provides the tools to monitor, diagnose, check network connectivity, and understand your network traffic, so you can identify what is causing the slow performance and take steps to optimize it. \n\nIn addition, Network watcher also features security and auditing tools like NSG Flow Logs and Connection Monitor to help you keep an eye on the potential security threats and maintain the network's health. This not only ensures consistent performance but also helps you to secure the network.\n\nUsing Network Watcher, you can avoid substantial downtime for your services and improve both the accessibility and security of your Azure network.\n  \n```markdown\n- **Scenario**: Troubleshooting and Performance Monitoring in Azure Network \n- **Solution**: Enable Network Watcher for Azure subscriptions\n  - Monitor the network performance to identify the causes of slow service access.\n  - Diagnose network issues using tools like IP Flow verify, Packet capture, and Next hop.\n  - Check network connectivity to your service and between Azure resources with Connection troubleshoot.\n  - Use security and auditing tools to keep an eye on the potential security threats and maintain the network's health.\n  - Identify security risks and check for unauthorized access with NSG Flow Logs.\n```"
    ]
  },
  "Managed": true
}