{
  "ID": "azure_storage_account_soft_delete_enabled",
  "Title": "Ensure soft delete is enabled for Azure Storage",
  "Description": "The Azure Storage blobs contain data like ePHI, Financial, secret or personal. Erroneously modified or deleted accidentally by an application or other storage account user cause data loss or data unavailability. It is recommended the Azure Storage be made recoverable by enabling soft delete configuration. This is to save and recover data when blobs or blob snapshots are deleted.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_storage_account",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_storage_account",
    "QueryToExecute": "select\n  sa.id as resource,\n  sa.kaytu_account_id as kaytu_account_id,\n  sa.kaytu_resource_id as kaytu_resource_id,\n  case\n    when not blob_soft_delete_enabled then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when not blob_soft_delete_enabled then sa.name || ' blobs soft delete disabled.'\n    else sa.name || ' blobs soft delete enabled.'\n  end as reason\n  \n  , sa.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_storage_account sa,\n  azure_subscription sub\nwhere\n  sub.subscription_id = sa.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "3.8"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "3"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Storage"
    ],
    "x-kaytu-explanation": [
      "Azure Storage is a service provided by Microsoft to store large amounts of data for very low costs. This data can be accessed from anywhere in the world via HTTP or HTTPS. It could be personal, financial, secret, or even electronic protected health information (ePHI).\n\nHowever, due to human or application errors, this data might be accidentally deleted or modified, leading to data loss or unavailability. To connect these situations, Azure Storage features a function named \"Soft Delete\".\n\nSoft Delete is a data protection feature in Azure Storage that, once enabled, allows the recovery of any blobs or blob snapshots that have been deleted. The blob content remains available, or \"soft deleted\", for a certain period of specified by the user, allowing applications to read the data. During this period, it is possible to restore the soft-deleted blobs back to the active state if required.\n\nTo enable Soft Delete, you can use the Azure portal, Azure CLI, Azure PowerShell, or one of the Azure Storage client libraries.\n\nHere's an example of how to enable Soft Delete using Azure CLI:\n\n```shell\naz storage blob service-properties delete-policy update --days-retained 7 --account-name mystorageaccount --enable true\n```\n\nIn this example, the `--days-retained` flag specifies the number of days soft-deleted blobs are recoverable, `--account-name` is the name of your storage account, and `--enable` is set to true to enable the policy.\n\nWith this feature, you can keep your Azure Storage data safe and recoverable, effectively reducing the risk of accidental data loss."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to the specified Azure control, which recommends enabling soft delete configuration for Azure Storage, can result in significant cost implications. Here are some possible costs in a markdown format:\n\n1. **Data Loss Costs**: The greatest potential cost is irrevocable data loss. If blobs containing critical data like ePHI (Electronic Protected Health Information), Financial data, or personal information are deleted accidentally, they may not be retrievable if soft delete configuration was not enabled. The cost of such data loss can be significantly high, depending on the criticality of the lost data.\n\n2. **Business Continuity Costs**: If the lost data was essential for everyday business operations, then this could disrupt business continuity, resulting in financial losses and reputational damage.\n\n3. **Regulatory Fines**: If the lost data includes sensitive data like ePHI or personal information, this could result in non-compliance with regulations such as HIPAA or GDPR. Business can face severe regulatory fines or legal actions due to such non-compliances.\n\n4. **Recovery Costs**: If the deleted data can be recovered from other sources or backups, there still might be significant recovery costs involved. These recovery costs involve not just the cost of the backup infrastructure, but also the labor cost involved in the recovery process, and the opportunity cost of the downtime period.\n\n5. **Customer Trust**: Losing customer data could potentially cost you customer trust and future business prospects. \n\n6. **Data Recreating Costs**: In some cases, lost data might need to be recreated - which can cost resources, time, and efforts.\n\nHence, non-compliance to the Azure control that suggests making Azure Storage recoverable by enabling soft delete, can result in significant costs. It is always a good security practice to prevent data loss by taking advantage of configurations like soft delete."
    ],
    "x-kaytu-usefulness-example": [
      "`Example:`\n```\nImagine a company working in Financial technology where it processes credit card transactions and stores the transaction data on Azure Storage blobs. This data includes customer PII and it is crucial for the company in terms of customer service as well as compliance with financial regulations. \n\nOne day, due to a programming error, a new release of the company's software accidentally starts to delete several blob files. Without the soft delete feature enabled, the company would lose access to valuable transaction data, resulting in potential regulatory penalties and negative impact on customer experience. \n\nIf soft delete is enabled in the Azure Storage blobs, even though the blobs are 'deleted' by the faulty application, they are merely marked for deletion and not permanently removed. The blobs will be available for the period defined in the retention policy (the default being 7 days). Within this retention period, the blobs can be recovered easily using PowerShell, Azure CLI, or Azure portal, and the impact of the error is minimized.\n\nHence, enabling the soft delete option on Azure Storage blobjects offers a safety net which can be very useful to prevent data loss due to accidental deletion.\n```"
    ]
  },
  "Managed": true
}