{
  "ID": "azure_storage_account_secure_transfer_required_enabled",
  "Title": "Ensure that 'Secure transfer required' is set to 'Enabled'",
  "Description": "Enable data encryption in transit.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_storage_account",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_storage_account",
    "QueryToExecute": "select\n  sa.id as resource,\n  sa.kaytu_account_id as kaytu_account_id,\n  sa.kaytu_resource_id as kaytu_resource_id,\n  case\n    when not enable_https_traffic_only then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when not enable_https_traffic_only then sa.name || ' encryption in transit not enabled.'\n    else sa.name || ' encryption in transit enabled.'\n  end as reason\n  \n  , sa.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_storage_account sa,\n  azure_subscription sub\nwhere\n  sub.subscription_id = sa.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "3.1"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "3"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Storage"
    ],
    "x-kaytu-explanation": [
      "Azure provides a way to ensure your data is secure while it is being transmitted from one location to another with the function of data encryption in transit. It involves employing security measures to protect data during its movement in-between different networks or while it is going from host to host. \n\nThis feature can be enabled by using a simple markup language in the Azure portal. The specific markup code may differ depending on the specific service you want to secure like Azure Storage, Azure SQL Database, Azure Web App etc.  \n\nHere is a basic example of how it would look in a Azure Resource Manager (ARM) template JSON file when enabling HTTPS only traffic for an Azure Storage account. \n\n```json\n{\n  \"type\": \"Microsoft.Storage/storageAccounts\",\n  \"apiVersion\": \"2021-01-01\",\n  \"name\": \"[parameters('storageName')]\",\n  \"location\": \"[parameters('location')]\",\n  \"properties\": {\n    \"supportsHttpsTrafficOnly\": true,\n    \"encryption\": {\n      \"services\": {\n        \"blob\": {\n          \"enabled\": true\n        },\n        \"file\": {\n          \"enabled\": true\n        }\n      },\n      \"keySource\": \"Microsoft.Storage\"\n    }\n  }\n}\n```\n\nThis specific section enables data encryption in transit: \n```json\n\"supportsHttpsTrafficOnly\": true,\n```\nThis code indicates that only encrypted (HTTPS) connections are allowed for transferring data into or out of the Azure Storage account, hence ensuring data encryption in transit.\n\nPlease note that this is just one way to secure data in Azure and there are other options available depending on the services used and specific business needs and scenarios."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with the Azure control of enabling data encryption in transit can lead to a range of costs that include the following:\n\n1. **Security Risks:** Unencrypted data is easier for malicious parties to intercept and exploit. This could lead to unauthorized access of user data or potentially even damaging server attacks.\n\n2. **Financial Losses:** Data breaches often come with significant monetary costs. These may include damage repairs, system updates, refunds to affected users, and potentially even fines or lawsuits.\n\n3. **Regulatory Fines:** Various industries and regions are subject to certain regulations (like GDPR) that require certain levels of data protection. Non-compliance can lead to substantial fines or sanctions.\n\n4. **Reputation Damage:** If customers and clients find out that their data has been compromised due to a lack of encryption in transit, this can greatly harm a company's reputation.\n\n5. **Loss of Trust:** A breach in security could lead to a loss of trust from clients, customers, or business partners who may choose to take their business elsewhere.\n\nIn summary, enabling data encryption in transit is a necessary measure to protect user data and avoid potential security threats, financial losses, regulatory penalties, and loss of trust."
    ],
    "x-kaytu-usefulness-example": [
      "For example, if an organization is hosting a confidential business application on Azure. This application stores sensitive information like business data, customer details, financial transactions, etc. \n\nIt is crucial to ensure that this sensitive data remains secure when it is being transmitted over the network from the application to the user, between Azure services, etc. \n\nBy enabling data encryption in transit, the organization can add an extra layer of security to the data transmission. Any data that is transmitted will be encrypted using industry-standard encryption protocols, making it unreadable to anyone who might intercept it.\n\n```markup\n\u003ctransitEncryption\u003e\n   \u003cenabled\u003etrue\u003c/enabled\u003e\n   \u003crequireSecureTransfer\u003etrue\u003c/requireSecureTransfer\u003e\n   \u003cserviceURI\u003ehttps://myapp.azurewebsites.net\u003c/serviceURI\u003e\n   \u003ccertificate\u003e\n      \u003cthumbprint\u003eABCD1234EFGH5678IJKL9012MNOP3456QRSTUV78\u003c/thumbprint\u003e\n      \u003cthumbprintAlgorithm\u003esha256\u003c/thumbprintAlgorithm\u003e\n   \u003c/certificate\u003e\n\u003c/transitEncryption\u003e\n```\n\nIn this markup, `enabled` is set to `true`, signifying that data encryption in transit is enabled. `requireSecureTransfer` is also on, ensuring that all data transfers occur over a secure connection. The `serviceURI` specifies the URI of the service where the data transfer is happening. `Thumbprint` and `thumbprintAlgorithm` are used to specify the certificate details used for the encryption."
    ]
  },
  "Managed": true
}