{
  "ID": "azure_monitor_log_alert_create_update_nsg",
  "Title": "Ensure that Activity Log Alert exists for Create or Update Network Security Group",
  "Description": "Create an Activity Log Alert for the \"Create\" or \"Update Network Security Group\" event.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as (\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and (\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Network/networkSecurityGroups/write\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n  limit 1\n)\nselect\n  sub.subscription_id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when count(a.subscription_id) \u003e 0 then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when count(a.subscription_id) \u003e 0 then 'Activity log alert exists for create or update Network Security Group event.'\n    else 'Activity log alert does not exists for create or update Network Security Group event.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription sub\n  left join alert_rule a on sub.subscription_id = a.subscription_id\ngroup by\n  sub._ctx,\n  sub.subscription_id,\n  sub.kaytu_account_id,\n  sub.kaytu_resource_id,\n  sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.3"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "This AWS control is about setting up an alert system in Amazon's AWS environment for specific events that are related to the creation or updating of a Network Security Group. The Activity Log Alert would be useful for keeping track of these events for system monitoring, security, or audit purposes. Here is a markup explanation for setting up this alert:\n\nStep 1: Enable AWS CloudTrail\n\nTo start with, you need to enable AWS CloudTrail which is a service that provides event history of your AWS account activity.\n\n```AWS Management Console \u003e Services \u003e CloudTrail \u003e Trails \u003e Create trail```\n\nStep 2: Setup Amazon SNS\n\nAfter enabling AWS CloudTrail, you then need to setup an Amazon Simple Notification Service (SNS) which is a web service that coordinates and manages the delivery or sending of messages to subscribing endpoints or clients.\n\n```AWS Management Console \u003e Services \u003e SNS \u003e Create Topic \u003e Follow the Steps```\n\nStep 3: Create a CloudWatch Logs Group\n\nNow, you have to create a AWS CloudWatch Logs Group where AWS CloudTrail sends logs. \n\n```AWS Management Console \u003e Services \u003e CloudWatch \u003e Logs \u003e Create log group```\n\nStep 4: Create a CloudWatch Events Rule\n\nThe final step involves creating a CloudWatch Events rule which targets the SNS topic you created. This rule filters events from AWS CloudTrail logs.\n\n```AWS Management Console \u003e Services \u003e CloudWatch \u003e Events \u003e Create rule \u003e Follow the Steps```\n\nFor event source, you will need to select \"CloudTrail\". For event pattern, you would need to specify Network Security Group as the resource type and Create/Update as the event names. Lastly, specify your SNS topic as the event target.\n\n```\n{\n  \"source\": [\n    \"aws.ec2\"\n  ],\n  \"detail-type\": [\n    \"AWS API Call via CloudTrail\"\n  ],\n  \"detail\": {\n    \"eventSource\": [\n      \"ec2.amazonaws.com\"\n    ],\n    \"eventName\": [\n      \"CreateSecurityGroup\",\n      \"AuthorizeSecurityGroupIngress\",\n      \"AuthorizeSecurityGroupEgress\",\n      \"RevokeSecurityGroupIngress\",\n      \"RevokeSecurityGroupEgress\",\n      \"DeleteSecurityGroup\"\n    ]\n  }\n}\n```\n\nThis rule will then trigger an alert to the specified SNS topic every time a Network Security Group is created or updated."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to this AWS Control could pose significant security and financial risks, detailed as follows:\n\n1. **Security Risk**: The primary cost of not setting up an alert for the \"Create\" or \"Update Network Security Group\" event is a potential compromise in security. If alerts aren't being sent when changes are made to Network Security Group, malicious changes might go unnoticed, giving potential attackers an advantage. \n\n2. **Audit Failures**: If a company is obligated to meet certain compliance standards (like ISO 27001, PCI-DSS, etc.), not having these alerts could lead to audit failures. \n\n3. **Increased Time to Identify Issues**: Another cost is the delay in troubleshooting. If a network issue arises, and if there are no alerting mechanisms in place, identifying the root cause of the issue (like misconfigurations or unauthorized changes) might take longer than expected.\n\n4. **Financial Loss**: In the worst-case scenario, unauthorized access might cause financial losses. Data breaches could result in loss of customer trust and legal issues.\n\nHence, it's vital that alerts for critical events like \"Create\" or \"Update Network Security Group\" are set up correctly to mitigate security risks and ensure compliance with internal controls and regulatory obligations."
    ],
    "x-kaytu-usefulness-example": [
      "For example, mid-sized company X has multiple projects running on Amazon Web Services (AWS). The company is keen on maintaining a high standard of security due to the sensitive nature of the data handled in the projects. Therefore, they use Network Security Groups to restrict access to their AWS resources. \n\nHowever, incidents occur where resources are either exposed mistakenly due to changes in the security groups or due to unauthorized access. In these cases, configuring an Activity Log alert for the \"Create\" or \"Update Network Security Group\" events would be beneficial. \n\nWhen such an alert is set up, the security team is instantly notified when a new Network Security Group is created or an existing one is modified. This allows them to promptly review the changes for any potential security risks and take appropriate actions. This alert further prevents unauthorized changes from going unnoticed and averts the potential damage that could have occurred. \n\nThis exemplifies the usefulness of AWS Control in maintaining the security standards. Thanks to this, Company X can steadily improve the security awareness in its environment while minimizing incidents related to changes in Network Security Groups."
    ]
  },
  "Managed": true
}