{
  "ID": "azure_storage_account_min_tls_1_2",
  "Title": "Ensure the 'Minimum TLS version' is set to 'Version 1.2'",
  "Description": "Azure Storage sets the minimum TLS version to be version 1.0 by default. TLS 1.0 is a legacy version and has known vulnerabilities. This minimum TLS version can be configured to be later protocols such as TLS 1.2.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_storage_account",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_storage_account",
    "QueryToExecute": "select\n  sa.id as resource,\n  sa.kaytu_account_id as kaytu_account_id,\n  sa.kaytu_resource_id as kaytu_resource_id,\n  case\n    when minimum_tls_version = 'TLSEnforcementDisabled' then 'alarm'\n    when minimum_tls_version = 'TLS1_2' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when minimum_tls_version = 'TLSEnforcementDisabled' then sa.name || ' TLS enforcement is disabled.'\n    when minimum_tls_version = 'TLS1_2' then sa.name || ' minimum TLS version set to ' || minimum_tls_version || '.'\n    else sa.name || ' minimum TLS version set to ' || minimum_tls_version || '.'\n  end as reason\n  \n  , sa.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_storage_account sa,\n  azure_subscription sub\nwhere\n  sub.subscription_id = sa.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "3.12"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "3"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.4.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Storage"
    ],
    "x-kaytu-explanation": [
      "Azure Control is a component of Azure that allows the configuration of various settings including the minimum Transport Layer Security (TLS) version.\n\nTransport Layer Security is used to establish a secure encrypted communication channel between the client and the server over the internet. It is an important security mechanism to prevent eavesdropping and tampering of data.\n\nIn this context, Azure Storage by default is set to use a minimum of TLS version 1.0. This version however is considered a legacy version as it has several known vulnerabilities and is no longer considered secure for handling sensitive data. \n\nTo ensure a higher level of security for your data, Azure Storage allows you to configure the minimum TLS version to be later protocols such as TLS 1.2. \n\nThis configuration can be made in the Azure portal, Azure CLI, Azure PowerShell, or in the Service Management API. By setting your minimum TLS version to 1.2, you ensure that all connections made to your Azure storage account will be protected by this later, more secure protocol."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with this Azure control can lead to several potential costs, which can be broadly categorized into security-related costs, regulatory-related costs, and reputation-related costs.\n\n1. **Security-Related Costs**  \nIgnoring to set Azure Storage's minimum TLS version to a more recent protocol can render your stored data susceptible to cybersecurity threats. Encryption protocols such as TLS 1.0 are outdated and have publicly known vulnerabilities, leaving your system exploitable by malicious hackers. Security breaches can lead to unauthorized access, alteration, or destruction of sensitive data, which could, in turn, incur significant data recovery costs and potential financial losses from disruption of normal business operations.\n\n    *Example: If the security breach resulted in the loss of customer data, you might have to incur costs to restore the lost data and reinforce your cybersecurity measures.*\n\n2. **Regulatory-Related Costs**   \nMany industries today are subject to data protection regulations (like GDPR in Europe and CCPA in California), and failure to comply can lead to large fines. Compliance with these regulations can often involve using up-to-date and secure data transmission protocols, such as TLS 1.2 or later. \n\n    *Example: A healthcare sector organization non-compliant with this Azure control might violate the Healthcare Insurance Portability and Accountability Act (HIPAA) in the US, leading to hefty fines.*\n\n3. **Reputation-Related Costs**  \nIf non-compliance leads to a data breach, it can damage the trust of your customers, partners, and stakeholders, leading to potential loss in business. Restoring reputation can take a considerable amount of time and resources.\n\n    *Example: After a data breach, you might need to hire PR firms or invest in other methods to restore your organization's tarnished reputation.*\n\nTherefore, it is highly advisable to ensure compliance with this control by setting the minimum TLS version of Azure Storage to 1.2 or later, to mitigate the risks of non-compliance."
    ],
    "x-kaytu-usefulness-example": [
      "Azure Storage's configuration to set the minimum Transport Layer Security (TLS) version can be very useful in ensuring the security of the data being transmitted over the network. For instance, a financial institution using Azure cloud services may store and process sensitive client data. By configuring the minimum TLS version to a more secure protocol, such as TLS 1.2, the institution makes sure that any data transmitted between its servers and the Azure cloud storage is always encrypted using robust and secure encryption methods, thereby reducing the chances of a successful cyber attack. \n\n```xml\n\u003cServiceProperties\u003e\n  \u003cMinTLSVersion\u003e1.2\u003c/MinTLSVersion\u003e\n\u003c/ServiceProperties\u003e\n```\n\nThis small markup segment from an Azure Storage configuration file enforces the use of TLS 1.2 as the minimum version, which would provide a significant extra layer of security compared to the default TLS 1.0. This is especially critical when dealing with personal identifiable information (PII) or other sensitive data, as it can help prevent eavesdropping, tampering, or message forgery."
    ]
  },
  "Managed": true
}