{
  "ID": "azure_storage_account_blob_containers_public_access_private",
  "Title": "Ensure that 'Public access level' is set to Private for blob containers",
  "Description": "Disable anonymous access to blob containers and disallow blob public access on storage account.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_storage_account",
      "azure_storage_container",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_storage_container",
    "QueryToExecute": "select\n  container.id as resource,\n  container.kaytu_account_id as kaytu_account_id,\n  container.kaytu_resource_id as kaytu_resource_id,\n  case\n    when not account.allow_blob_public_access and container.public_access = 'None' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when not account.allow_blob_public_access and container.public_access = 'None'\n      then account.name || ' container ' || container.name || ' doesn''t allow anonymous access.'\n    else account.name || ' container ' || container.name || ' allows anonymous access.'\n  end as reason\n  \n  , container.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_storage_container container\n  join azure_storage_account account on container.account_name = account.name\n  join azure_subscription sub on sub.subscription_id = account.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "3.5"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "3"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Storage"
    ],
    "x-kaytu-explanation": [
      "Azure Blob Storage is a service for storing large amounts of unstructured data that can be accessed from anywhere in the world via HTTP or HTTPS. By default, this data is private and can only be accessed by authorized users.\n\nHowever, Azure provides options to enable anonymous, public read access to a blob container and its blobs. This means anyone on the internet can read the data without needing any keys or tokens.\n\nIf you want to disable this anonymous access, you can modify the container's public access level setting to 'Private'. This can be done through the Azure portal, Azure PowerShell, or Azure CLI.\n\nIn Azure portal:\n\n1. Navigate to the storage account you want to modify, and then click 'Blob service' -\u003e 'Containers'.\n2. Select the container you want to modify, and then click 'Change access level'.\n3. In the 'Change access level' pane, select 'Private (no anonymous access)', and then click 'OK'.\n\nIf you want to disallow all public blob access at the account level, Azure has a feature called 'Disallow public blob access'. When enabled, this feature overrides the public access settings of all containers in the storage account and disallows public blob access.\n\nIn Azure portal:\n\n1. Go to the 'Settings' section of the storage account you want to modify.\n2. Click on 'Configuration'.\n3. Set the 'Disallow public blob access' toggle to 'Enabled', and then click 'Save'.\n\nIn Azure CLI:\n\n```bash\naz storage account update --name mystorageaccount --resource-group myresourcegroup --allow-blob-public-access false\n```\n\nAzure Control in markup (XML) format may look like this:\n\n```xml\n\u003cStorageServiceProperties\u003e\n   \u003cDisallowPublicBlobAccess\u003etrue\u003c/DisallowPublicBlobAccess\u003e\n\u003c/StorageServiceProperties\u003e\n```\n\nPlease replace 'mystorageaccount' and 'myresourcegroup' with your actual storage account name and resource group name."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to this Azure control - \"Disable anonymous access to blob containers and disallow blob public access on storage account\" comes with several costs:\n\n1. **Data Breach**: Granting public access to your blob containers can lead to unauthorized access to sensitive data, potentially leading to vast financial losses due to data leakage.\n\n2. **Legal and Regulatory Liabilities**: Depending on the nature of the data stored, organizations could face penalties and other legal implications for not complying with applicable laws and regulations about data protection.\n\n3. **Loss of Reputation**: If an organization suffers from a data breach due to non-compliance, it could lead to a loss of customer trust and damaged reputation.\n\n4. **Loss of Intellectual Property**: If the blob containers contain proprietary information or intellectual property, unauthorized access could lead to a loss of competitive advantage.\n\n5. **Potential Disruption of Services**: In some serious attacks, the entire storage account can be compromised, which could lead to service disruption.\n\n6. **Increased Security Threat**: Non-compliance may expose the system to different types of attacks like DDoS attacks, data injection attacks, etc.\n\nTo mitigate these risks, it's crucial to ensure compliance with Azure controls, and specifically in this case - disable anonymous access to blob containers and disallowing blob public access on storage accounts, thus preventing unauthorized access to sensitive information."
    ],
    "x-kaytu-usefulness-example": [
      "Microsoft Azure allows the management of permissions for blob containers. Restricting anonymous public access and disallowing blob public access at the storage account level are two ways of ensuring the security of the container blob data. \n\nFor instance, suppose a company is using a blob container to store sensitive data such as client's personal identifiable information, financial records, or proprietary company data. Such data cannot be exposed to the public due to compliance rules, privacy laws, or simply business confidentiality requirements. In this case, the company needs to enforce strict access controls to ensure data integrity and confidentiality. \n\nHere is how the markup in an Azure Resource Manager template would look like to disable anonymous access and public access:\n\n```\n{\n    \"type\": \"Microsoft.Storage/storageAccounts\",\n    \"apiVersion\": \"2019-06-01\",\n    \"name\": \"[parameters('storageAccounts_name')]\",\n    \"location\": \"[parameters('location')]\",\n    \"sku\": {\n        \"name\": \"[parameters('storageAccounts_sku_name')]\"\n    },\n    \"kind\": \"StorageV2\",\n    \"properties\": {\n        \"supportsHttpsTrafficOnly\": true,\n        \"allowBlobPublicAccess\": false,\n        \"networkAcls\": {\n            \"bypass\": \"AzureServices\",\n            \"virtualNetworkRules\": [],\n            \"ipRules\": [],\n            \"defaultAction\": \"Deny\"\n        }\n    }\n}\n```\nThis code block defines a storage account resource in Azure with `allowBlobPublicAccess` set to `false`, meaning the storage account will disallow blob public access. The `defaultAction` is also set to `Deny`, which means that it prohibits all traffic to the blob aside from exceptions specified in the `ipRules` and `virtualNetworkRules` sections."
    ]
  },
  "Managed": true
}