{
  "ID": "azure_keyvault_logging_enabled",
  "Title": "Ensure that logging for Azure KeyVault is 'Enabled'",
  "Description": "Enable AuditEvent logging for key vault instances to ensure interactions with key vaults are logged and available.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_key_vault",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_key_vault",
    "QueryToExecute": "with logging_details as (\n  select\n    name as key_vault_name\n  from\n    azure_key_vault,\n    jsonb_array_elements(diagnostic_settings) setting,\n    jsonb_array_elements(setting -\u003e 'properties' -\u003e 'logs') log\n  where\n    diagnostic_settings is not null\n    and setting -\u003e 'properties' -\u003e\u003e 'storageAccountId' \u003c\u003e ''\n    and (log -\u003e\u003e 'enabled') :: boolean\n    and log -\u003e\u003e 'category' = 'AuditEvent'\n    and (log -\u003e 'retentionPolicy') :: JSONB ? 'days'\n)\nselect\n  v.id as resource,\n  v.kaytu_account_id as kaytu_account_id,\n  v.kaytu_resource_id as kaytu_resource_id,\n  case\n    when v.diagnostic_settings is null then 'alarm'\n    when l.key_vault_name not like concat('%', v.name, '%') then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when v.diagnostic_settings is null then v.name || ' logging not enabled.'\n    when l.key_vault_name not like concat('%', v.name, '%') then v.name || ' logging not enabled.'\n    else v.name || ' logging enabled.'\n  end as reason\n  \n  , v.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_key_vault v,\n  logging_details l,\n  azure_subscription sub\nwhere\n  sub.subscription_id = v.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.1.5"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.1"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/KeyVault"
    ],
    "x-kaytu-explanation": [
      "## Enable AuditEvent Logging for Azure Key Vault Instances\n\nTo enhance security and compliance, it is essential to enable AuditEvent logging for Azure Key Vault instances. This ensures that all interactions with key vaults are properly logged and available for review.\n\n### Steps:\n\n1. **Navigate to Azure Portal:**\n   - Open the [Azure Portal](https://portal.azure.com/) and sign in to your account.\n\n2. **Select Key Vaults:**\n   - In the left navigation pane, select \"Key Vaults\" to view a list of your key vault instances.\n\n3. **Choose Key Vault:**\n   - Select the specific Key Vault instance for which you want to enable audit logging.\n\n4. **Navigate to Auditing:**\n   - In the Key Vault's menu, go to \"Settings\" and choose \"Auditing\" from the options.\n\n5. **Enable AuditEvent Logging:**\n   - Toggle the switch to enable \"AuditEvent\" logging for the selected Key Vault.\n\n6. **Configure Retention (Optional):**\n   - Optionally, configure retention settings for audit logs based on your compliance requirements.\n\n7. **Save Changes:**\n   - Save your changes to apply the AuditEvent logging configuration.\n\n### Verification:\n\nTo confirm that AuditEvent logging is successfully enabled, perform a test interaction with the Key Vault (e.g., access a secret), and check the audit logs for the corresponding entry.\n\nBy following these steps, you ensure that all relevant activities within the Azure Key Vault are logged, providing a comprehensive audit trail for security monitoring and compliance purposes.\n"
    ],
    "x-kaytu-noncompliance-cost": [
      "# Cost of Non-Compliance: AuditEvent Logging for Key Vault Instances\n\n## Description\nEnabling AuditEvent logging for Azure Key Vault instances is essential to ensure that all interactions with key vaults are properly logged and made available for monitoring and auditing purposes. This control enhances security measures by providing a detailed record of activities within the Key Vault environment.\n\n## Risks of Non-Compliance\n\n### 1. Unauthorized Access\nWithout AuditEvent logging, there is a higher risk of unauthorized access to sensitive information stored in Key Vaults. Lack of detailed logs makes it difficult to identify and trace who accessed the key vaults and what operations were performed.\n\n### 2. Lack of Visibility\nNon-compliance results in a lack of visibility into key vault interactions, hindering the ability to monitor and detect anomalous activities. This can lead to delayed detection of security incidents or breaches.\n\n### 3. Compliance Violations\nFailure to enable AuditEvent logging may result in non-compliance with regulatory requirements and industry standards, exposing the organization to potential legal and financial consequences.\n\n### 4. Limited Forensic Capabilities\nIn the event of a security incident, the absence of detailed logs makes forensic analysis challenging. Investigating the scope and impact of a security breach becomes more difficult without a comprehensive record of Key Vault activities.\n\n## Benefits of Compliance\n\n### 1. Enhanced Security\nEnabling AuditEvent logging strengthens the security posture by providing a comprehensive trail of all interactions with Key Vaults. This information is crucial for detecting and mitigating security threats promptly.\n\n### 2. Regulatory Compliance\nCompliance with this control ensures that the organization meets regulatory requirements related to data protection and access control. It helps in demonstrating adherence to industry standards and guidelines.\n\n### 3. Improved Incident Response\nDetailed logs facilitate quicker and more effective incident response. Security teams can promptly identify and respond to security incidents, minimizing the potential impact on the organization.\n\n## Conclusion\n\nEnabling AuditEvent logging for Key Vault instances in Azure is not just a best practice but a fundamental security control. The costs of non-compliance include increased vulnerability to unauthorized access, regulatory violations, and compromised incident response capabilities. Organizations should prioritize compliance with this control to enhance their overall security posture.\n"
    ],
    "x-kaytu-usefulness-example": [
      "To enable AuditEvent logging for Key Vault instances in Azure, you can use Azure Policy along with Azure Policy Initiatives. Below is an example of how you can define an Azure Policy Initiative in JSON format to enforce AuditEvent logging for Key Vault instances:\n\njson\nCopy code\n{\n  \"policyDefinitions\": [\n    {\n      \"policyDefinitionId\": \"/providers/Microsoft.Authorization/policyDefinitions/AuditEventLoggingKeyVault\",\n      \"policyDefinitionName\": \"AuditEventLoggingKeyVault\",\n      \"policyDefinitionVersion\": \"1.0.0\",\n      \"parameters\": {},\n      \"policyRule\": {\n        \"if\": {\n          \"allOf\": [\n            {\n              \"field\": \"type\",\n              \"equals\": \"Microsoft.KeyVault/vaults\"\n            }\n          ]\n        },\n        \"then\": {\n          \"effect\": \"audit\",\n          \"details\": {\n            \"operations\": [\n              \"Microsoft.KeyVault/vaults/write\",\n              \"Microsoft.KeyVault/vaults/delete\"\n            ],\n            \"auditingSettings\": {\n              \"auditLogs\": [\n                {\n                  \"category\": \"AuditEvent\"\n                }\n              ]\n            }\n          }\n        }\n      }\n    }\n  ],\n  \"policySetDefinitions\": [\n    {\n      \"policySetDefinitionId\": \"/providers/Microsoft.Authorization/policySetDefinitions/AuditEventLoggingKeyVaultInitiative\",\n      \"policySetDefinitionName\": \"AuditEventLoggingKeyVaultInitiative\",\n      \"policySetDefinitionVersion\": \"1.0.0\",\n      \"parameters\": {},\n      \"policyDefinitions\": [\n        {\n          \"policyDefinitionId\": \"/providers/Microsoft.Authorization/policyDefinitions/AuditEventLoggingKeyVault\",\n          \"parameters\": {}\n        }\n      ]\n    }\n  ]\n}\nIn this example:\n\nThe policy definition AuditEventLoggingKeyVault is defined to audit write and delete operations on Key Vault instances, and specifically, it audits the \"AuditEvent\" category.\nThe policy set definition AuditEventLoggingKeyVaultInitiative includes the AuditEventLoggingKeyVault policy definition.\nYou can assign the AuditEventLoggingKeyVaultInitiative to your Azure subscriptions or resource groups to enforce the policy.\nThis policy initiative ensures that all interactions (write and delete operations) with Key Vault instances are audited, helping you maintain a secure and compliant environment. Adjust the policy rules and definitions based on your specific auditing requirements."
    ]
  },
  "Managed": true
}