{
  "ID": "azure_iam_user_not_allowed_to_create_security_group",
  "Title": "Ensure that 'Users can create security groups in Azure portals, API or PowerShell' is set to 'No'",
  "Description": "Restrict security group creation to administrators only.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_tenant",
      "azuread_authorization_policy"
    ],
    "PrimaryTable": "azuread_authorization_policy",
    "QueryToExecute": "select\n  a.id as resource,\n  a.kaytu_account_id as kaytu_account_id,\n  a.kaytu_resource_id as kaytu_resource_id,\n  case\n    when a.default_user_role_permissions -\u003e\u003e 'allowedToCreateSecurityGroups' = 'false' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when a.default_user_role_permissions -\u003e\u003e 'allowedToCreateSecurityGroups' = 'false' then a.display_name || ' does not allow user to create security groups.'\n    else a.display_name || ' allows user to create security groups.'\n  end as reason,\n  t.tenant_id\n  \nfrom\n  azure_tenant as t,\n  azuread_authorization_policy as a;\n"
  },
  "DocumentURI": "",
  "ManualVerification": true,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "1.19"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "1"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/ActiveDirectory"
    ],
    "x-kaytu-explanation": [
      "This Azure control in markup format is designed to limit the ability to create security groups only to administrators. This prevents non-administrative users from creating security groups, which could result in unintended or inappropriate access to resources. This measure is important for maintaining a secure environment in Azure, as it ensures that only authorized individuals can define and manage access controls.\n\nIn practical terms, this control might be implemented via a policy assignment in Azure Policy using the following code:\n\n```json\n{\n  \"properties\": {\n    \"displayName\": \"Restrict security group creation to administrators only\",\n    \"policyType\": \"Custom\",\n    \"mode\": \"Indexed\",\n    \"description\": \"This policy ensures that only users with the appropriate administrative privileges can create security groups in Azure.\",\n    \"metadata\": {\n      \"version\": \"1.0.0\",\n      \"category\": \"Security\"\n    },\n    \"parameters\": {},\n    \"policyRule\": {\n      \"if\": {\n        \"allOf\": [\n          {\n            \"field\": \"type\",\n            \"equals\": \"Microsoft.Network/networkSecurityGroups\"\n          },\n          {\n            \"not\": {\n              \"field\": \"Microsoft.Network/networkSecurityGroups/securityRules[*]\",\n              \"exists\": \"false\"\n            }\n          }\n        ]\n      },\n      \"then\": {\n        \"effect\": \"audit\"\n      }\n    }\n  }\n}\n```\nThe code above would be part of a `.json` file that defines the policy.\n\nNote: While the above JSON is a sample (generic) and does not necessarily directly enforce the 'admin-only creation' for security groups, similar rules can be crafted to monitor and enforce such requirements. I'd recommend looking into Azure Policy's built-in roles (like `Network Contributor`, `Security Admin`, etc.) as well as 'deny' and 'audit' effects for more precise control."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with the Azure control of restricting security group creation to administrators only could have several potential costs.\n\n### Security Risks\n\n1. **Unauthorised Access**: Unrestricted security group creation might allow non-administrative or even malicious users to create security groups with lax permissions, providing them with additional, potentially unauthorized accesses. This can lead to data breaches, information theft, or even cyber-attacks on the cloud infrastructure.\n\n2. **Inconsistent Policies**: Inability to maintain consistent security policies across the organization can flourish when security groups aren't regulated. This can make it challenging to uphold the necessary cybersecurity protocols, and may lead to vulnerabilities.\n\n3. **Increased Attack Surface**: Every security group that non-admins open creates a new potential point of entry for attackers. The more security groups, the larger the attack surface, and the more difficult it is to monitor and protect.\n\n### Financial Risks\n\n1. **Regulatory Fines**: If the loss or theft of data results from poor security group management, the organization might face substantial fines from regulatory bodies for failing to adequately protect that information.\n\n2. **Cleanup Costs**: After a data breach or cyber-attack, significant resources must be dedicated to investigating the event, eradicating the threat, and repairing the damage. There may also be costs associated with public relations efforts and rebuilding customer trust.\n\n3. **Potential Lawsuits**: If clients or partners suffer harm due to your inadequate security, they might be able to successfully litigate for damages.\n\n### Operational Risks\n\n1. **Disruption of Service**: If a security incident occurs, it might disrupt regular services while the threat is addressed.\n\n2. **Loss of Efficiency**: If anyone can create security groups, your organization's cloud infrastructure may become cluttered and inefficient.\n\nComplying with this Azure control is the direct concern of not only the IT team but also high-level management. The cost of non-compliance often extends far beyond immediate financial impact and can have long-lasting effects on the company’s reputation, customer trust, and overall business performance."
    ],
    "x-kaytu-usefulness-example": [
      "This Azure control policy helps to reduce the risk of unauthorized or accidental changes to the network infrastructure. It ensures only trusted administrators have the ability to create or modify security groups, limiting the potential for security vulnerabilities or misconfigurations.\n\nHere is an example in the ARM (Azure Resource Management) template format:\n\n```markup\n{\n  \"properties\": {\n    \"displayName\": \"Restrict security group creation to administrators only\",\n    \"policyType\": \"BuiltIn\",\n    \"mode\": \"Indexed\",\n    \"description\": \"This policy ensures that only administrators can create or modify security groups\",\n    \"metadata\": {\n      \"version\": \"1.0.0\",\n      \"category\": \"Network\"\n    },\n    \"parameters\": {\n      \"effect\": {\n        \"type\": \"String\",\n        \"metadata\": {\n          \"displayName\": \"Effect\",\n          \"description\": \"Enable or disable the execution of the policy\"\n        },\n        \"allowedValues\": [\n          \"audit\",\n          \"disabled\",\n          \"denied\"\n        ],\n        \"defaultValue\": \"denied\"\n      }\n    },\n    \"policyRule\": {\n      \"if\": {\n        \"allOf\": [\n          {\n            \"field\": \"type\",\n            \"equals\": \"Microsoft.Network/networkSecurityGroups\"\n          },\n          {\n            \"not\": {\n              \"field\": \"Microsoft.Authorization/permissions/roleDefinitionNames\",\n              \"equals\": \"Network Contributor\"\n            }\n          }\n        ]\n      },\n      \"then\": {\n        \"effect\": \"[parameters('effect')]\"\n      }\n    }\n  },\n  \"id\": \"/providers/Microsoft.Authorization/policyDefinitions/restrictSecurityGroupCreationToAdmins\",\n  \"type\": \"Microsoft.Authorization/policyDefinitions\",\n  \"name\": \"restrictSecurityGroupCreationToAdmins\"\n}\n```\nThe above policy enforces that only users with the `Network Contributor` role are able to create or modify network security groups. If a non-admin user tries to create or update a security group, the policy blocks the action and logs the incident."
    ]
  },
  "Managed": true
}