{
  "ID": "azure_monitor_log_alert_create_update_public_ip_address",
  "Title": "Ensure that Activity Log Alert exists for Create or Update Public IP Address rule",
  "Description": "Create an activity log alert for the Create or Update Public IP Addresses rule.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as\n(\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and\n    (\n      ( alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/publicipaddresses\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Network/publicIPAddresses/write\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/publicipaddresses\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n    limit 1\n)\nselect\n  sub.subscription_id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when count(a.subscription_id) \u003e 0 then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when count(a.subscription_id) \u003e 0 then 'Activity Log Alert exists for Create or Update Public IP Address rule.'\n    else 'Activity Log Alert does not exists for Create or Update Public IP Address rule.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription sub\n  left join alert_rule a on sub.subscription_id = a.subscription_id\ngroup by\n  sub.kaytu_account_id,\n  sub.kaytu_resource_id,\n  sub._ctx,\n  sub.subscription_id,\n  sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.9"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "Sure, here's how you would explain this in markup format:\n\n```markdown\n# AWS Control: Create an Activity Log Alert for the Create or Update Public IP Addresses Rule\n\nThis AWS control refers to the process of establishing an alert notification which gets triggered whenever there is an activity related to the creation or update of Public IP addresses in your AWS environment. This ensures that you are notified about any potential security risks or unwanted changes.\n\n## Overview\n\nThe 'Create or Update Public IP Addresses' rule monitors all activities related to your AWS services that may create or update public IP addresses. Creating an activity log alert for this rule helps to set an automated surveillance for these critical tasks. \n\nThe 'Create or Update Public IP Addresses' rule can cover services like Amazon EC2, where you can allocate or associate an Elastic IP address (a static IPv4 address) for your instances.\n\n## Steps to Set Up the Alert\n\n1. Go to the **CloudWatch** dashboard in your AWS Management Console.\n2. Click on **Alarms** and then click on **Create Alarm**.\n3. In the **Create Alarm** wizard, select the **Metric**.\n4. Define the conditions for your alarm.\n5. In **Actions**, select an existing Amazon SNS Topic, or create a new one for the notification.\n6. Click on **Create Alarm** to set up the alert.\n\nEnsure that you have the proper permissions and roles to create a new alarm.\n\nRemember to review these alerts periodically to ensure that they are functioning properly.\n```\nPlease note that the exact process might vary depending on the specific AWS setting and services used."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to the \"Create or Update Public IP Addresses\" rule can result in several significant costs. \n\n1. **Security Breach Costs:** \n   If activity log alerts for creating or updating public IP addresses are not created, suspicious activities may go unnoticed, leading to security breaches. Unauthorized access of an organization's data can lead to huge financial losses due to data theft and the expenses of remedial actions.\n\n2. **Regulatory Fine Costs:** \n   Non-compliance could also potentially result in regulatory fines, especially in industries such as healthcare or finance where there are strict data privacy requirements. Authorities can impose significant penalties for data breaches caused by non-compliance with standards.\n\n3. **Reputation Damage Costs:**\n   Data breaches can also lead to severe damage to a company's reputation, potentially resulting in loss of customers. The cost of this sort of damage can be substantial and long-lasting.\n\n4. **Operational Costs**: \n   Failures, such as unexpected public IP changes, can cause service disruptions and loss of productivity, which in turn lead to financial losses.\n\nIn summary, the cost of non-compliance to this AWS control could lead to substantial economic consequences through direct losses, penalties, and remedial expenditures. Therefore, it is critically important to implement such controls effectively."
    ],
    "x-kaytu-usefulness-example": [
      "Example:\n\nAn IT company runs a variety of applications on their AWS environment with numerous IP addresses. To maintain the security and privacy of their applications, they have kept all their IP addresses as private. However, there are occasions when public IP addresses may need to be created or updated.\n\nFor instance, a developer working on one of the applications may unknowingly create a public IP address. This could potentially expose sensitive data to unauthorized individuals or make their systems vulnerable to potential threats. \n\nTherefore, to take control over these situations and to be notified when public IP addresses are created or updated, they set up an activity log alert for the 'Create or Update Public IP Addresses' rule. \n\nWith AWS Control, they can record and process AWS management console sign-in events and any action made within their AWS environment. This can be defined through the AWS Management Console, AWS SDKs, command-line tools, and other AWS services.\n\nThis control will shed light on who made the request, the services used, the actions performed, parameters for the actions, and the response elements returned by the AWS service.\n\nHere is an example of how this can be done in markup format:\n\n```markdown\naws_cloudwatch_client = boto3.client('events', region_name=region)\nrule_response = aws_cloudwatch_client.put_rule(\n    Name='CreateorUpdatePublicIPAddresses',\n    EventPattern=json.dumps(event_pattern),\n    State='ENABLED',\n)\ncidr_ip = \"{0}/32\".format(new_source_ip)\naws_cloudwatch_client.put_targets(\n    Rule='CreateorUpdatePublicIPAddresses',\n    Targets=[\n        {\n            'Arn': alarm_arn,\n            'Id': 'CreateorUpdatePublicIPAddresses',\n            'Input': json.dumps(\n                {\n                    'alarm_actions': [sns_topic_arn],\n                    'metric_name': 'CreateorUpdatePublicIPAddresses',\n                    'statistic': 'SampleCount',\n                    'period': 300,\n                    'evaluation_periods': 1,\n                    'threshold': 1,\n                    'comparison_operator': 'GreaterThanOrEqualToThreshold'\n                }\n            )\n        }\n    ]\n)\n```\n\nThis log alert can be helpful in monitoring the AWS environment and therefore triggering a necessary action whenever new public IPs are created or updated. This ultimately aids in maintaining their application's confidentiality and security."
    ]
  },
  "Managed": true
}