{
  "ID": "azure_monitor_log_alert_delete_security_solution",
  "Title": "Ensure that Activity Log Alert exists for Delete Security Solution",
  "Description": "Create an activity log alert for the Delete Security Solution event.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as (\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and (\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Security\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.security/securitysolutions\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Security/securitySolutions/delete\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Security\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.security/securitysolutions\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n  limit 1\n)\nselect\n  sub.subscription_id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when count(a.subscription_id) \u003e 0 then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when count(a.subscription_id) \u003e 0 then 'Activity log alert exists for delete Security Solution event.'\n    else 'Activity log alert does not exists for delete Security Solution event.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription sub\n  left join alert_rule a on sub.subscription_id = a.subscription_id\ngroup by\n  sub.kaytu_account_id,\n  sub.kaytu_resource_id,\n  sub._ctx,\n  sub.subscription_id,\n  sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.8"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "Creating an alert for the \"Delete Security Solution\" event is a security measure for threat protection within AWS (Amazon Web Services) environment. By creating this alert, you'll be notified whenever such action is triggered, allowing you to react promptly. Below is how to create this activity log alert.\n\nAWS CloudTrail allows you to monitor your AWS deployments by continuously tracking all activity occurring within your AWS environment. By utilising CloudTrail with CloudWatch, you can create alerts for various events. Here, we are focusing on the \"Delete Security Solution\" event.\n\nYou have to specify the event selector in CloudTrail, then log these events into CloudWatch logs. Once the logs are in CloudWatch, you can set up Metrics based on certain filters. With these metrics, you can create an alarm and associate it with an SNS Topic to receive email notifications.\n\nHere are the steps in markup format:\n``` markup\n1. Open the CloudTrail console at https://console.aws.amazon.com/cloudtrail/.\n2. In the navigation pane, click on Event history.\n3. Use the filter to specify the event source as DeleteSecurityGroup action.\n4. Once you have identified the events, Click on 'Create Alarm'.\n5. In the 'Create Alarm' window, define the conditions and the notifications for the alarm.\n6. Click 'Create Alarm'.\n```\nPlease replace the URLs and event names with the specific ones for your need. Create an SNS Topic and subscribe your email to the topic to receive the notifications.\n\nNote: AWS Responsibility is to provide the activity logs, and it's upon user how he/she configures CloudWatch alerts."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to the AWS Control of creating an activity log alert for the Delete Security Solution event can lead to several potential consequences that involve financial, operational, and reputational cost:\n\n1. **Lost Data:** Deleting a security solution may lead to a loss of crucial data. If there are no alerts for these actions, the company might not notice the loss until it's too late, leading to potential revenue loss.\n\n2. **Security Breaches:**Without an activity log alert, unauthorized users could potentially delete a security solution without being noticed. The company could become vulnerable to cyber attacks, leading to potential financial and data loss. \n\n3. **Increased Reaction Time:** If a security solution has been deleted unintentionally or maliciously, having immediate alerts can allow rapid response and mitigation. Without these alerts, more time will pass before the issue is discovered, leading to a greater impact.\n\n4. **Non-compliance Penalties:** This AWS Control might be a part of the compliance with a specific standard (like ISO 27001, HIPAA, etc.). Non-compliance with those standards can result in heavy fines and penalties.\n\n5. **Reputational Damage:** Non-compliance might result in a data breach. Such incidents get often widely reported in the press, damaging the company's credibility and reputation.\n\nThus, non-compliance to this control not only leaves the system open to significant security risks but could also result in sizable penalties, lost customers, and other damaging consequences."
    ],
    "x-kaytu-usefulness-example": [
      "Example Instance:\n\nA multinational corporation uses AWS as its primary cloud services provider in managing its applications and data storage. In a recent auditing performed by the security division, they found that there were malicious activities happening within their AWS resources. When they dig deeper into the issue, they discovered that one of their security solutions has been mysteriously deleted without proper notification.\n\nTo prevent further mishaps, they have decided to utilize AWS Control to establish an activity log alert for the \"Delete Security Solution\" event. This way, whenever there's an attempt or activity that deletes their security solutions, they'll be notified promptly. \n\nThe AWS Control not only sends notifications but also details, such as who performed the activity, the exact time it was performed, and the system from where the operation was executed. This information aids in conducting a more in-depth investigation and in modifying their security settings to prevent a potential compromise on their AWS resources.\n\nIn effect, the organization can maintain a high security posture, monitor the activities proactively within their AWS environment, and reduce the chances of unidentified and unauthorized activities trying to damage their security framework. So, this feature of AWS Control became an essential tool for them in managing their security and data protection within AWS."
    ]
  },
  "Managed": true
}