{
  "ID": "azure_sql_server_va_setting_periodic_scan_enabled",
  "Title": "Ensure that VA setting Periodic Recurring Scans is enabled on a SQL server",
  "Description": "Enable Vulnerability Assessment (VA) Periodic recurring scans for critical SQL servers and corresponding SQL databases.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_sql_server",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_sql_server",
    "QueryToExecute": "select\n  s.id as resource,\n  s.kaytu_account_id as kaytu_account_id,\n  s.kaytu_resource_id as kaytu_resource_id,\n  case\n    when\n      security -\u003e 'properties' -\u003e\u003e 'state' = 'Disabled'\n      or\n      (\n        security -\u003e 'properties' -\u003e\u003e 'state' = 'Enabled'\n        and assessment -\u003e 'properties' -\u003e\u003e 'storageContainerPath' is not null\n        and assessment -\u003e 'properties' -\u003e 'recurringScans' -\u003e\u003e 'isEnabled' = 'false'\n      )\n      then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when\n      security -\u003e 'properties' -\u003e\u003e 'state' = 'Disabled'\n      or\n      (\n        security -\u003e 'properties' -\u003e\u003e 'state' = 'Enabled'\n        and assessment -\u003e 'properties' -\u003e\u003e 'storageContainerPath' is not null\n        and assessment -\u003e 'properties' -\u003e 'recurringScans' -\u003e\u003e 'isEnabled' = 'false'\n      )\n      then s.name || ' VA setting periodic recurring scans disabled.'\n    else s.name || ' VA setting periodic recurring scans enabled.'\n  end as reason\n  \n  , s.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_sql_server s,\n  jsonb_array_elements(server_security_alert_policy) security,\n  jsonb_array_elements(server_vulnerability_assessment) assessment,\n  azure_subscription sub\nwhere\n  sub.subscription_id = s.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "4.2.3"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "4.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SQL"
    ],
    "x-kaytu-explanation": [
      "Azure Control in markup format refers to the set of security policies written in HTML/XML to control the security threats on Azure.\n\nWhat this particular statement means is that you are setting up a regular (perhaps daily or weekly) scan on key SQL servers and their respective SQL databases through the Azure platform's Vulnerability Assessment (VA) tool. This tool regularly checks the system for any potential weaknesses that could be exploited by hackers.\n\nThis is specifically important for SQL servers as they usually contain significant data, and any potential vulnerability could lead to a significant loss. By enabling VA periodic recurring scans, you are ensuring that the system is constantly being monitored and evaluated for potential threats to prevent any kind of data breaches or system failures.\n\nMarkup Example:\n\n```xml\n\u003cazureControl\u003e\n  \u003cVA_Scan\u003e\n    \u003cSQLServer\u003e\n      \u003cenable\u003etrue\u003c/enable\u003e\n      \u003crecurring\u003etrue\u003c/recurring\u003e\n      \u003cfrequencyInHours\u003e24\u003c/frequencyInHours\u003e\n    \u003c/SQLServer\u003e\n    \u003cSQLDatabase\u003e\n      \u003cenable\u003etrue\u003c/enable\u003e\n      \u003crecurring\u003etrue\u003c/recurring\u003e\n      \u003cfrequencyInHours\u003e24\u003c/frequencyInHours\u003e\n    \u003c/SQLDatabase\u003e\n  \u003c/VA_Scan\u003e\n\u003c/azureControl\u003e\n```\nThis is a basic example in XML. The recurring scans are scheduled every 24 hours for both the SQL server and its databases. It shows that VA scan for SQL Server and databases are enabled and set to be recurring."
    ],
    "x-kaytu-noncompliance-cost": [
      "The cost of non-compliance to the Azure Control that mandates enabling Vulnerability Assessment (VA) periodic recurring scans for critical SQL servers and corresponding SQL databases can be serious. \n\n1. **Increased Risks of Security Breaches**: When VA is not implemented, vulnerabilities in SQL servers and databases may go undetected. By exploiting these vulnerabilities, attackers may be able to gain unauthorized access to your data, modify it, or even execute malicious programs. \n\n2. **Data Loss or Theft**: Attackers exploiting vulnerabilities could potentially steal sensitive data, which may lead to serious consequences such as business losses, legal action or damage to your company’s reputation. \n\n3. **Legal \u0026 Compliance Penalties**: If your company is ever audited and found non-compliant with specific cybersecurity regulations (like GDPR, HIPAA, etc.), the company might face substantial fines and sanctions.\n\n4. **Operational Disruption**: Severe attacks might lead to substantial operational disruptions. It could affect your company’s productivity or even entirely halt operations. \n\n5. **Remediation Costs**: If vulnerabilities get exploited before they are identified and addressed, the cost of rectifying the problem may be quite high. This includes the cost of patching the vulnerability, as well as potentially having to restore the lost or corrupted data.\n\nRemember that the cost of preventing security breaches is generally much less than dealing with the aftermath of a breach."
    ],
    "x-kaytu-usefulness-example": [
      "Azure SQL Vulnerability Assessment (VA) is a service that helps you discover, track, and remediate potential database vulnerabilities. It provides visibility into your security state, and it includes actionable steps to investigate, manage, and resolve security issues in your SQL databases.\n\n```markup\nExample:\n\nConsider an e-commerce company with a large database that stores all product, customer, and transaction information. The database contains sensitive data like credit card numbers, personal customer information, etc.\n\nIf this database isn't secured properly, it could be vulnerable to attacks, leading to data breaches, financial loss, and harm to the company's reputation. \n\nBy enabling Azure VA's periodic recurring scans for this critical SQL server and corresponding SQL databases, the e-commerce company can:\n1. Identify and fix vulnerabilities before they are exploited by attackers.\n2. Improve its database security posture, reducing the risk of a data breach.\n3. Stay compliant with data protection regulations by regularly assessing their database for vulnerabilities.\n4. Get a detailed report about the security state of the SQL databases, with actionable steps to reduce the risk.\n```\nUsing the Azure VA is an important part of a defense-in-depth strategy, allowing the company to ensure the protection of sensitive data and maintain customer trust."
    ]
  },
  "Managed": true
}