{
  "ID": "azure_securitycenter_azure_defender_on_for_keyvault",
  "Title": "Ensure that Azure Defender is set to On for Key Vault",
  "Description": "Turning on Azure Defender enables threat detection for Key Vault, providing threat intelligence, anomaly detection, and behavior analytics in the Azure Security Center.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_subscription_pricing",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_subscription_pricing",
    "QueryToExecute": "select\n  sub_pricing.id as resource,\n  sub_pricing.kaytu_account_id as kaytu_account_id,\n  sub_pricing.kaytu_resource_id as kaytu_resource_id,\n  case\n    when pricing_tier = 'Standard' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when pricing_tier = 'Standard' then 'Azure Defender on for Key Vaults.'\n    else 'Azure Defender off for Key Vaults.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_security_center_subscription_pricing sub_pricing\n  right join azure_subscription sub on sub_pricing.subscription_id = sub.subscription_id\nwhere\n  name = 'KeyVaults';\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "low",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.8"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "AWS and Azure are two different cloud service providers. It seems you have a little confusion here. Let's correct it for you.\n\nAzure Defender is a built-in tool in Microsoft Azure, not AWS (Amazon Web Services). \n\n```markup\n**Azure Defender for Key Vault**\n\nWhen enabled, Azure Defender for Key Vault provides threat detection for your Key Vault services in Azure. This involves:\n\n1. **Threat Intelligence**: It assists by identifying potential threats using data from global cybersecurity threats. \n\n2. **Anomaly Detection**: Azure Defender for Key Vault continuously monitors your key vaults to detect any anomalous activities and alerts you about suspicious behavior.\n\n3. **Behavioral Analytics**: To further strengthen the security, Azure Defender applies behavioral analytics to understand normal patterns and identify any unusual activities.\n\nAll the detections and alerts generated by Azure Defender for Key Vault can be viewed and managed in the Azure Security Center, making it a central point for managing the security of your Azure resources.\n```\n\nIt should be noted that Azure Defender and Azure Security Center are Microsoft Azure services, and these are not related to AWS (Amazon Web Services)."
    ],
    "x-kaytu-noncompliance-cost": [
      "AWS Control refers to a specific set of policies and procedures set by Amazon Web Services (AWS) to manage and monitor the health, performance, and security of AWS resources. The question seems to confuse two different platforms, AWS and Microsoft Azure.\n\nIf we are discussing Azure instead of AWS, then the cost of non-compliance to the control of not turning on Azure Defender for Key Vault could be:\n\n- Increased Security Alarms: Without enabling Azure Defender, resources will not be protected from threats, giving a chance for malicious activities to occur unnoticed. Cybersecurity threats could lead to huge financial and reputational costs.\n\n- Missed Anomalies: Ensuring the Azure Defender is on helps to detect anomalies that can reveal potentially harmful activities or system weaknesses. Without it, these irregularities could go unnoticed, leading to further problems down the line.\n\n- Lack of Behavioral Analytics: Without Azure Defender, an Azure Key Vault will miss out on key behavior analytics that help to gain insights into activity and identify unusual user behaviors, which might indicate a security compromise.\n\n- Regulatory Fines: Depending on the industry and the type of data a company holds, not complying with data protection regulations and controls might result in substantial fines.\n\nTherefore, the cost of non-compliance can be both direct (fines, legal fees, etc.) and indirect (damage to brand reputation, customer loss, etc.). Companies should always strive to comply with all relevant controls to maintain the security, performance, and health of their systems."
    ],
    "x-kaytu-usefulness-example": [
      "- An e-commerce business can use Azure Defender for maintaining the security of their AWS Key Vault. The business stores all its encryption keys and secrets, such as the credentials to the database, and client data access tokens, in the AWS Key Vault. Turning on Azure Defender will alert the security team about threats like an unusual amount of access requests to the Key Vault or access from suspicious IP addresses, effectively preventing potential security breaches."
    ]
  },
  "Managed": true
}