{
  "ID": "azure_sql_server_va_setting_reports_notify_admins",
  "Title": "Ensure that VA setting 'Also send email notifications to admins and subscription owners' is set for a SQL server",
  "Description": "Enable Vulnerability Assessment (VA) setting 'Also send email notifications to admins and subscription owners'.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_sql_server",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_sql_server",
    "QueryToExecute": "select\n  s.id as resource,\n  s.kaytu_account_id as kaytu_account_id,\n  s.kaytu_resource_id as kaytu_resource_id,\n  case\n    when\n      security -\u003e 'properties' -\u003e\u003e 'state' = 'Disabled'\n      or\n      (\n        security -\u003e 'properties' -\u003e\u003e 'state' = 'Enabled'\n        and assessment -\u003e 'properties' -\u003e\u003e 'storageContainerPath' is not null\n        and assessment -\u003e 'properties' -\u003e 'recurringScans' -\u003e\u003e 'emailSubscriptionAdmins' = 'false'\n      )\n      then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when\n      security -\u003e 'properties' -\u003e\u003e 'state' = 'Disabled'\n      or\n      (\n        security -\u003e 'properties' -\u003e\u003e 'state' = 'Enabled'\n        and assessment -\u003e 'properties' -\u003e\u003e 'storageContainerPath' is not null\n        and assessment -\u003e 'properties' -\u003e 'recurringScans' -\u003e\u003e 'emailSubscriptionAdmins' = 'false'\n      )\n      then s.name || ' VA setting not configured to send email notifications to subscription admins and owners.'\n    else s.name || ' VA setting configured to send email notifications to subscription admins and owners.'\n  end as reason\n  \n  , s.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_sql_server s,\n  jsonb_array_elements(server_security_alert_policy) security,\n  jsonb_array_elements(server_vulnerability_assessment) assessment,\n  azure_subscription sub\nwhere\n  sub.subscription_id = s.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "4.2.5"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "4.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SQL"
    ],
    "x-kaytu-explanation": [
      "Azure Vulnerability Assessment (VA) is a service that provides visibility into your security state through continuous assessment of your environment. This can help to detect and fix security vulnerabilities before they can be exploited.\n\nIn Azure, you can enable a setting that allows VA to also send email notifications to admins and subscription owners whenever a vulnerability is detected. This can be particularly useful for ensuring that the right people are aware of any potential security issues as soon as possible. \n\nThe markup to enable this setting might look something like this:\n\n```xml\n\u003cVulnerabilityAssessmentSettings\u003e\n  \u003cSendNotificationsToAdmins\u003etrue\u003c/SendNotificationsToAdmins\u003e\n\u003c/VulnerabilityAssessmentSettings\u003e\n```\n\nThis markup is using XML format. When the 'SendNotificationsToAdmins' tag is set to 'true', it means that the VA will also send email notifications to admins and subscription owners. Please note this is a hypothetical explanation because the actual process involves configurations in the Azure portal or using Azure CLI or PowerShell but not the XML markup format."
    ],
    "x-kaytu-noncompliance-cost": [
      "The cost of non-compliance with the Azure Control that requires the setting 'Also send email notifications to admins and subscription owners' in your Vulnerability Assessment (VA) could be very extensive:\n\n1. **Undetected Threats**: If this control is not enabled, administrators and subscription owners may not receive immediate or prompt notifications about potential vulnerabilities. This can delay the response to threats and expose the Azure environment to avoidable risks.\n\n2. **Increased Risks**: This can lead to an increase in potential breaches to security, data loss, or downtime which may result in regulatory fines if sensitive data is involved.\n\n3. **Operational Disruption**: Lack of prompt vulnerability notifications can lead to operational disruptions as responding to a threat after it has caused damage is often a more lengthy and complex process, which can impact productivity and escalate recovery costs.\n\n4. **Increased Financial Costs**: Responding to cyber threats or attacks could require massive resources in terms of manpower and finances, especially if the threat leads to a data breach, system misconfiguration, or unwanted system interruption.\n\n5. **Damage to Reputation**: If vulnerabilities are exploited due to this oversight, the incident could damage the organization’s reputation, especially if clients' or users' data are compromised. Customers could potentially lose trust and confidence in the services, which can lead to reduced customer base and sales revenue.\n\n6. **Legal Consequences**: If an organization is found to be non-compliant with certain laws, regulations, or standards (specific to the industry or type of data handled), it could face legal consequences, including heavy fines or sanctions.\n\nTherefore, it is essential to follow the Azure Control's guidelines to enable Vulnerability Assessment settings for sending notifications to admins and subscription owners."
    ],
    "x-kaytu-usefulness-example": [
      "Azure's Vulnerability Assessment (VA) is a useful tool that helps to identify and mitigate potential security risks to your resources. Enabling the 'Also send email notifications to admins and subscription owners' setting can enhance your organization's security management, as outlined in the following instance:\n\n```\nJohn is a Security Engineer responsible for maintaining the security of cloud-based resources in his company. They have diverse resources hosted on Azure and it's crucial for John and his team to not overlook any potential vulnerabilities.\n\nTo ensure effective security management, John has activated Azure's Vulnerability Assessment for his organization's resources. Moreover, he has enabled the 'Also send email notifications to admins and subscription owners' setting. \n\nThis configuration is very beneficial:\n\n- It makes security management more proactive. Now, whenever the Vulnerability Assessment identifies a potential risk, both John and the subscription owner instantly receive an email alert.  \n\n- The immediacy of these notifications allows John and his team to quickly respond to vulnerabilities and prevent any potential breaches.\n\n- Moreover, since the subscription owner also receives the notification, it boosts transparency about the state of security within the company.\n\n```\nHence, this Azure control setting is effective in enhancing real-time security risk identification and management."
    ]
  },
  "Managed": true
}