{
  "ID": "azure_securitycenter_notify_alerts_configured",
  "Title": "Ensure that 'Notify about alerts with the following severity' is set to 'High'",
  "Description": "Enables emailing security alerts to the subscription owner or other designated security contact.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_contact",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_contact",
    "QueryToExecute": "with contact_info as (\n  select\n    count(*) filter (where alert_notifications = 'On') as notification_alert_count,\n    subscription_id\n  from\n    azure_security_center_contact\n  group by\n    subscription_id\n  limit 1\n)\nselect\n  sub.subscription_id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when notification_alert_count \u003e 0 then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when notification_alert_count \u003e 0 then '\"Notify about alerts with the following severity\" set to High.'\n    else '\"Notify about alerts with the following severity\" not set to High.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription sub\n  left join contact_info ci on sub.subscription_id = ci.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "low",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.14"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "AWS Control provides an opportunity for you to enhance your security measures by allowing you to enable emailing of security alerts. This control can be directed to the subscription owner or any other designated security contact involved in the security of your AWS environment.\n\nThis can be useful in various scenarios, such as when suspicious activity is detected, when there are configuration changes, or when there are any breaches in compliance rules.\n\nHere is an example in markup format:\n\n´´´\n\u003cAWSControl\u003e\n   \u003cEnableEmailAlerts\u003etrue\u003c/EnableEmailAlerts\u003e\n   \u003cContact\u003e\n      \u003cName\u003e[ContactName]\u003c/Name\u003e\n      \u003cEmail\u003e[ContactEmail]\u003c/Email\u003e\n   \u003c/Contact\u003e\n   \u003cAlert\u003e\n      \u003cType\u003eSecurity\u003c/Type\u003e\n      \u003cDescriptor\u003eSuspicious activity detected\u003c/Descriptor\u003e\n   \u003c/Alert\u003e\n\u003c/AWSControl\u003e\n´´´\n\nThis markup specifies that email alerts are enabled (`EnableEmailAlerts` is set to `true`). It provides details of the designated security contact (`ContactName` and `ContactEmail`). It also specifies the type of alert to be issued (`Type` is set to `Security`) and provides a descriptor for the security alert."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to this AWS Control may result in several potential costs:\n\n1. **Security Risks**: If security alerts are not emailed to the subscription owner or other designated security contacts, potential security threats or breaches may go unnoticed. This could result in unauthorized access to data or damage to the system. \n\n2. **Financial Costs**: In the event of a breach, there could be significant financial costs associated with data recovery, system repair, and potential fines for compliance violations. Additionally, indirect costs such as lost business due to reputation damage should also be considered.\n\n3. **Operational Costs**: Delay in reaction time due to missing immediate security alert can cause prolonged system downtime which may affect business functionality and productivity.\n\n4. **Legal and Compliance Implications**: For industries that are highly regulated, failure to maintain adequate security protocols could result in fines, sanctions, or other legal repercussions.\n\n5. **Customer Trust**: If customer data is compromised as a result of non-compliance, it may lead to a loss of trust from customers, affecting the business negatively. \n\nIn summary, not enabling emailing of security alerts can lead to late recognition of potential threats, resulting in potential financial, operational, legal and reputational damage."
    ],
    "x-kaytu-usefulness-example": [
      "`Amazon Simple Notification Service (SNS)`\n\nAmazon SNS is a highly available, durable, secure, fully managed pub/sub messaging service that enables you to decouple microservices, distributed systems, and serverless applications. It allows you to send notification messages to multiple subscribers through a variety of protocols.\n\nExample:\n```\nA company has set up a CloudTrail alarm in their AWS environment which triggers an alert when there is any unauthorized API call. This is a key part of their security strategy to prevent any potential breaches. \n\nInstead of needing to manually check CloudWatch for these alerts, they have set up SNS to automatically email a designated security contact when the alert is triggered. This ensures immediate notification and prompt action can be taken to investigate and mitigate any potential threats.\n\nWith AWS SNS, the security team is now instantly aware of potential security issues and can take steps to address them, without needing to manually check for alerts.\n```"
    ]
  },
  "Managed": true
}