{
  "ID": "azure_network_security_group_rdp_access_restricted",
  "Title": "Ensure that RDP access is restricted from the internet",
  "Description": "Disable RDP access on network security groups from the Internet.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_network_security_group",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_network_security_group",
    "QueryToExecute": "with network_sg as (\n  select\n    distinct name sg_name\n  from\n    azure_network_security_group nsg,\n    jsonb_array_elements(security_rules) sg,\n    jsonb_array_elements_text(sg -\u003e 'properties' -\u003e 'destinationPortRanges' || (sg -\u003e 'properties' -\u003e 'destinationPortRange') :: jsonb) dport,\n    jsonb_array_elements_text(sg -\u003e 'properties' -\u003e 'sourceAddressPrefixes' || (sg -\u003e 'properties' -\u003e 'sourceAddressPrefix') :: jsonb) sip\n  where\n    sg -\u003e 'properties' -\u003e\u003e 'access' = 'Allow'\n    and sg -\u003e 'properties' -\u003e\u003e 'direction' = 'Inbound'\n    and (sg -\u003e 'properties' -\u003e\u003e 'protocol' ilike 'TCP' or sg -\u003e 'properties' -\u003e\u003e 'protocol' = '*')\n    and sip in ('*', '0.0.0.0', '0.0.0.0/0', 'Internet', 'any', '\u003cnw\u003e/0', '/0')\n    and (\n      dport in ('3389', '*')\n      or (\n        dport like '%-%'\n        and split_part(dport, '-', 1) :: integer \u003c= 3389\n        and split_part(dport, '-', 2) :: integer \u003e= 3389\n      )\n    )\n)\nselect\n  sg.id resource,\n  sg.kaytu_account_id as kaytu_account_id,\n  sg.kaytu_resource_id as kaytu_resource_id,\n  case\n    when nsg.sg_name is null then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when nsg.sg_name is null\n      then sg.title || ' restricts RDP access from internet.'\n    else sg.title || ' allows RDP access from internet.'\n  end as reason\n  \n  , sg.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_network_security_group sg\n  left join network_sg nsg on nsg.sg_name = sg.name\n  join azure_subscription sub on sub.subscription_id = sg.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "6.1"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "6"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Network"
    ],
    "x-kaytu-explanation": [
      "**Title**: Disable RDP access on Network Security Groups from the Internet\n\n**Control ID**: AWS-NetworkSecurity-RDP\n\n**Category**: Network Security\n\n**Description**: \n\nThe purpose of this control is to restrict unauthorized access to your AWS resources. Remote Desktop Protocol (RDP) is a protocol that allows users to access and control a remote computer or a virtual machine over a network connection. While RDP can be a useful tool, its exposure to the internet can pose a several security risk, including the potential for unauthorized access and data theft.\n\nThe control recommends disabling RDP access on network security groups from the Internet in order to maintain security and protect data.\n\n**Rationale**: \n\nExposing RDP to the internet increases the attack surface of a system. Disabling RDP reduces these risks and helps keep the system secure.\n\n**Audit Procedure**:\n\n1. Open the Amazon VPC console.\n2. In the navigation panel, choose 'Security Groups'.\n3. In the details pane, choose a security group.\n4. In the details pane, choose the 'Inbound' tab if it's not already chosen.\n5. Verify whether any rule permits inbound traffic from `0.0.0.0/0` or `::/0` to port `3389`.\n\n**Remediation**:\n\n1. Open the Amazon VPC console.\n2. In the navigation panel, choose 'Security Groups'.\n3. In the details pane, choose a security group.\n4. In the details pane, choose the 'Inbound' tab.\n5. For each rule that has `3389` as either the start or end of the port range, and the source is `0.0.0.0/0` or `::/0`, choose 'Edit inbound rules', and then choose 'Delete'.\n6. Choose 'Save'.\n\n**Compliance**:\n\nBy implementing this control, you ensure that your AWS resources are not vulnerable to potential unauthorized access attempts via RDP. This can help your organization achieve compliance with various cyber security standards and regulations.\n\n**References**:\n\n1. AWS Security Best Practices\n2. AWS VPC Security Groups\n\n**Control Owner**: \n\nAWS Administrator\n\n**Last Update Date**:\n\nMM/DD/YYYY"
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to this control proposed by Amazon Web Services has severe consequences in terms of cost.\n\n1. **Data Breach**:\n   \n   If RDP (Remote Desktop Protocol) access is not disabled on network security groups from the internet, it opens up the possibilities for potential hackers to gain unauthorized access to your environment. This leads to the risk of as data breach, the cleanup, and remanent effects of which are financially tasking. Costs incurred include forensic investigation, implementation of new security measures, potential fines, lawsuits, compensation to affected customers, and reputational damage leading to loss of customers.\n\n2. **Misuse of Resources**:\n   \n    If a hacker successfully gets access to your AWS environment, they could misuse the resources. For examples, they could instantiate large EC2 instances for mining cryptocurrencies or set up an infrastructure for a phishing campaign. You will be billed for all those used resources, resulting in unexpected and high AWS bills.\n\n3. **Non-compliance Fees**:\n   \n    Many industries are regulated and must comply with certain standards, such as GDPR, HIPAA, etc. If a security audit reveals that RDP access is enabled, it counts as a non-compliance issue, and your organization could face penalties and fines.\n\n4. **Security Expenses**:\n  \n    If RDP access is left open, it can pave the way for malware or other security threats to compromise your system. This implies additional costs will be incurred to remove such threats and restore the security and integrity of your system. This may also include expenses for the enhancement of current security infrastructure. \n\nTherefore, the cost of non-compliance with this AWS control can indeed be significant."
    ],
    "x-kaytu-usefulness-example": [
      "AWS control 'Disable RDP access on network security groups from the Internet' is highly useful in enhancing the overall system/network security of the hosted resources in AWS. RDP, also known as Remote Desktop Protocol, is a feature that allows users to access and manage systems remotely. While it is incredibly useful for administration, it can also be a significant security vulnerability if exposed to the Internet.\n\nExample:\n\nConsider a scenario where an organization hosts its application on AWS and permits RDP access from any IP address. If malicious attackers discover this, they could potentially initiate a brute force attack to gain illegal access to the organizational resources, leading to severe security breaches and data losses. \n\nIn such situations, employing the 'Disable RDP access on network security groups from the Internet' AWS control comes to the rescue. By implementing this control, the organization can prevent unauthorized RDP access to its instances, drastically mitigating the risk of cyber attacks, and maintaining the integrity and confidentiality of their AWS-hosted resources.\n\n```markdown\n- Organization: XYZ Corp\n- AWS Service: EC2 Instances\n- Control: Disable RDP access on network security groups from the Internet\n\nScenario:\nXYZ Corp hosts its business application on multiple EC2 instances that require RDP for remote management. However, to strengthen the security posture, they decided to disable RDP access from the Internet using the AWS control.\n\nSteps Taken:\n1. Navigated to the AWS Management Console \u003e VPC \u003e Security Groups.\n2. Selected the appropriate security group attached to the EC2 instances.\n3. Under the 'Inbound rules,' they removed any rules that allow RDP (port 3389) from '0.0.0.0/0' or '::/0'.\n4. They confirmed that the RDP access to the instances is only permitted from the trusted IPs within the organization.\n5. With this setup, they effectively disabled RDP access from the Internet, adding a significant layer of security against potential cyber threats.\n\nOutcome:\nThe implementation of the 'Disable RDP access on network security groups from the Internet' control effectively limited RDP access to only trusted sources, thereby reducing the risk of unauthorized access and potential cyber threats.\n```\n"
    ]
  },
  "Managed": true
}