{
  "ID": "azure_monitor_log_alert_delete_nsg",
  "Title": "Ensure that Activity Log Alert exists for Delete Network Security Group",
  "Description": "Create an activity log alert for the Delete Network Security Group event.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as (\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id,\n    jsonb_array_length(alert.condition -\u003e 'allOf')\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and (\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Network/networkSecurityGroups/delete\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n  limit 1\n)\n  select\n    sub.subscription_id as resource,\n    sub.kaytu_account_id as kaytu_account_id,\n    sub.kaytu_resource_id as kaytu_resource_id,\n    case\n      when count(a.subscription_id) \u003e 0 then 'ok'\n      else 'alarm'\n    end as status,\n    case\n      when count(a.subscription_id) \u003e 0 then 'Activity log alert exists for delete Network Security Group event.'\n      else 'Activity log alert does not exists for delete Network Security Group event.'\n    end as reason\n    \n    , sub.display_name as subscription\n  from\n    azure_subscription sub\n    left join alert_rule a on sub.subscription_id = a.subscription_id\n  group by\n    kaytu_account_id,\n    kaytu_resource_id,\n    sub._ctx,\n    sub.subscription_id,\n    sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.4"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "# Azure Control: Activity Log Alert for Delete Network Security Group Event\n\n## Overview\n\nAzure provides a powerful feature known as Activity Log Alerts, allowing users to monitor and respond to events that occur within their Azure resources. This markdown document outlines the steps to create an activity log alert specifically for the \"Delete Network Security Group\" event.\n\n## Procedure\n\n### 1. Navigate to Azure Portal\n\n- Open your preferred web browser and navigate to the [Azure Portal](https://portal.azure.com/).\n\n### 2. Access the Activity Log\n\n- In the Azure Portal, locate the \"Monitor\" section in the left-hand menu.\n- Select \"Activity log\" under the \"Monitoring\" category.\n\n### 3. Filter Activity Log Entries\n\n- Apply filters to narrow down the view and locate the specific \"Delete Network Security Group\" event.\n- You can use the time range, subscription, resource group, or other filters to refine the results.\n\n### 4. Create Activity Log Alert Rule\n\n- Once the desired event is identified, click on the \"Alert\" button to initiate the alert creation process.\n\n### 5. Configure Alert Rule Settings\n\n- In the alert rule configuration, specify the conditions that trigger the alert. This may include criteria such as event type, resource, severity, etc.\n- Set the desired alert threshold and frequency.\n\n### 6. Define Actions\n\n- Determine the actions to be taken when the alert is triggered. This can include sending notifications, executing Azure functions, or integrating with third-party services.\n\n### 7. Review and Create\n\n- Double-check the configured settings to ensure they meet your requirements.\n- Click on the \"Create\" or \"Save\" button to finalize the activity log alert rule.\n\n## Conclusion\n\nBy following these steps, you have successfully created an activity log alert in Azure specifically for the \"Delete Network Security Group\" event. This proactive monitoring approach helps you stay informed and take prompt action in response to critical events within your Azure environment.\n"
    ],
    "x-kaytu-noncompliance-cost": [
      "# Azure Control: Create Activity Log Alert for Delete Network Security Group Event\n\n## Cost of Non-Compliance:\n\n### Financial Implications:\n- **Penalties:** Failure to comply may result in financial penalties due to security breaches or unauthorized deletions.\n- **Data Loss Costs:** The deletion of a Network Security Group can lead to data loss, downtime, and recovery expenses.\n\n### Security Risks:\n- **Unauthorized Access:** Without monitoring deletions, there's a risk of unauthorized access to resources protected by the Network Security Group.\n- **Compromised Networks:** Lack of alerting increases the likelihood of unnoticed security breaches, potentially compromising the entire network.\n\n### Operational Impact:\n- **Downtime:** Deletion events may lead to network downtime, affecting operations and user accessibility.\n- **Recovery Time:** Recovering from a security incident may take longer without timely alerts, impacting business continuity.\n\n## Importance of the Control:\n\n- **Early Detection:** Creating an activity log alert ensures early detection of Delete Network Security Group events, allowing swift response to potential threats.\n- **Incident Response:** Timely alerts enable a quicker and more effective incident response, minimizing the impact on operations.\n- **Compliance Requirements:** Many regulatory frameworks mandate monitoring and alerting for security-relevant events, and non-compliance may lead to legal consequences.\n\n## Recommended Actions:\n\n1. **Configure Alerts:** Set up Azure Activity Log alerts specifically for the Delete Network Security Group event.\n2. **Define Thresholds:** Establish threshold values for alerting to avoid unnecessary noise while capturing critical events.\n3. **Regular Testing:** Periodically test the alerting system to ensure its effectiveness in identifying and notifying about deletion events.\n4. **Documentation:** Maintain documentation of alert configurations for audit purposes.\n\n## Conclusion:\n\nCompliance with the control to create an activity log alert for the Delete Network Security Group event is crucial for maintaining the security, integrity, and continuity of Azure environments. Failure to implement this control exposes the organization to financial losses, security risks, and operational disruptions.\n"
    ],
    "x-kaytu-usefulness-example": [
      "To create an activity log alert for the \"Delete Network Security Group\" event in Azure, you can use Azure Policy with the auditIfNotExists effect. Below is an example Azure Policy definition in JSON format that you can use for this purpose:\n\njson\n{\n  \"mode\": \"All\",\n  \"policyRule\": {\n    \"if\": {\n      \"field\": \"type\",\n      \"equals\": \"Microsoft.Network/networkSecurityGroups\",\n      \"and\": [\n        {\n          \"field\": \"Microsoft.Authorization/policyDefinitions\",\n          \"equals\": \"e1222c6d-d6e4-41f7-bd89-77e94b688348\"\n        },\n        {\n          \"field\": \"Microsoft.Authorization/policyDefinitions\",\n          \"equals\": \"72f988bf-86f1-41af-91ab-2d7cd011db47\"\n        }\n      ]\n    },\n    \"then\": {\n      \"effect\": \"auditIfNotExists\",\n      \"details\": {\n        \"type\": \"Microsoft.Insights/activityLogAlerts\",\n        \"existenceCondition\": {\n          \"field\": \"Microsoft.Insights/activityLogAlerts/actions\",\n          \"contains\": \"Delete Network Security Group\"\n        }\n      }\n    }\n  },\n  \"parameters\": {}\n}\nThis policy is checking for the existence of an activity log alert with the condition that the alert action contains \"Delete Network Security Group.\" If the alert doesn't exist, it will be audited.\n\nNote: This is a simplified example, and you may need to adjust it based on your specific requirements, such as subscription, resource group, and naming conventions. Also, make sure to replace the policy definition IDs (e.g., \"e1222c6d-d6e4-41f7-bd89-77e94b688348\") with the appropriate values from your Azure environment.\n\nOnce the policy is created and assigned to the appropriate scope (e.g., subscription, resource group), it will enforce the alert condition and generate audit events when the specified network security group deletion is detected in the activity log."
    ]
  },
  "Managed": true
}