{
  "ID": "azure_securitycenter_azure_defender_on_for_database",
  "Title": "Ensure That Microsoft Defender for Databases Is Set To 'On'",
  "Description": "Turning on Microsoft Defender for Databases enables threat detection for the instances running your database software. This provides threat intelligence, anomaly detection, and behavior analytics in the Azure Microsoft Defender for Cloud. Instead of being enabled on services like Platform as a Service (PaaS), this implementation will run within your instances as Infrastructure as a Service (IaaS) on the Operating Systems hosting your databases.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_subscription_pricing",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_subscription_pricing",
    "QueryToExecute": "with defender_list as (\n  select\n    json_object_agg(name, pricing_tier) as data,\n    subscription_id\n  from\n    azure_security_center_subscription_pricing\n  where\n    name = any(ARRAY ['CosmosDbs', 'OpenSourceRelationalDatabases', 'SqlServerVirtualMachines', 'SqlServers'])\n  group by\n    subscription_id\n)\nselect\n  sub.id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when\n      data -\u003e\u003e 'CosmosDbs' = 'Standard'\n      and data -\u003e\u003e 'OpenSourceRelationalDatabases' = 'Standard'\n      and data -\u003e\u003e 'SqlServerVirtualMachines' = 'Standard'\n      and data -\u003e\u003e 'SqlServers' = 'Standard'\n      then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when\n      data -\u003e\u003e 'CosmosDbs' = 'Standard'\n      and data -\u003e\u003e 'OpenSourceRelationalDatabases' = 'Standard'\n      and data -\u003e\u003e 'SqlServerVirtualMachines' = 'Standard'\n      and data -\u003e\u003e 'SqlServers' = 'Standard'\n      then 'Azure Defender on for Databases.'\n    else 'Azure Defender off for Databases.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription as sub\n  left join defender_list as l on l.subscription_id = sub.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.1.3"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2.1"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "AWS Control refers to different security settings and configurations that you can apply to your AWS resources to ensure their safety and security. However, it looks like here you're referencing Azure security services, and not AWS. Below is an explanation in markup format regardless.\n\n```markdown\n# Microsoft Defender for Databases on Azure\n\nMicrosoft Defender for Databases is a robust security solution that provides threat intelligence, anomaly detection, and behavior analytics for your database instances on Azure. \n\n## Key Features\n\n- **Threat Intelligence**: Detects known malicious patterns and activities on your database instances. \n- **Anomaly Detection**: Identifies unusual activities that might indicate a possible breach or attack.\n- **Behavior Analytics**: Provides insights into user behavior and usage patterns, enabling you to identify unauthorized or unusual access.\n\n## Implementation Detail\n\nUnlike many security solutions which function as a Platform as a Service (PaaS), Microsoft Defender for Databases runs directly in your instances as an Infrastructure as a Service (IaaS) on the Operating Systems that host your databases. As a result, it provides closer, in-depth monitoring and security for your databases.\n```\nPlease note that \"Microsoft Defender for Databases\" is a service offered by Azure and not AWS. For AWS, the equivalent service would be AWS Inspector or AWS GuardDuty."
    ],
    "x-kaytu-noncompliance-cost": [
      "The cost of non-compliance to the AWS control requiring the use of Microsoft Defender for Databases can be considered from various perspectives.\n\n1. **Data Breach Risks and Associated Costs**: Not using Microsoft Defender for Databases can expose your organization's databases to various threats, including malware, SQL injection attacks, ransomware and unauthorized access. Any successful attack can lead to a data breach, which can be incredibly costly. According to a study by IBM, the average cost of a data breach in 2020 was $3.86 million. These costs stem from notification expenses, forensic investigations, regulatory fines, litigation, lost business and rehabilitation of the company's image.\n\n2. **Non-compliance penalties**: Depending on the sector your organization operates within and the data it processes, non-compliance with required security controls can lead to substantial penalties. Regulatory bodies such as the GDPR in the European Union, HIPAA in the US healthcare sector, or PCI DSS in the payment card industry can impose fines reaching millions of dollars for failure to implement necessary security measures.\n\n3. **Operational Disruptions**: When databases are compromised or affected by malware, organizations may need to suspend operations, directly impacting productivity. Additionally, potential damage to the databases might require substantial resources to repair and restore normal services.\n\n4. **Reputation Damage**: Threats to data security may lead to data breaches, which can devastate an organization's reputation. Customers and partners could lose trust in the organization, leading to potential loss of business in the longer term.\n\n5. **Remediation Costs**: Non-compliance may lead to an expensive remediation process. Organizations may have to invest in incident response, forensic analysis, data recovery, and full systems checks. Also, the company may have to invest more resources to upgrade their security posture and to meet required compliance standards.\n\n**Note**: AWS control pertaining to Microsoft Defender for Databases would be specific to Microsoft Azure cloud environments, not AWS. It seems there might be some confusion in your original statement, as these are two distinct cloud service providers. Please ensure relevant controls for the specific vendor product and cloud environment are in place."
    ],
    "x-kaytu-usefulness-example": [
      "For example:\n\nCompany XYZ manages a large database of customer information on AWS. They use this information to build personalized marketing campaigns and for product development. Unfortunately, as their database size increases, so do the number of threats and vulnerabilities they face from potential cyber criminals who might want to gain unauthorized access to this sensitive information.\n\nBy turning on Microsoft Defender for Databases, Company XYZ can add an extra layer of security to their information trove. This service helps in recognizing unfamiliar or suspicious patterns and activities to prevent cyber attacks before they happen. Serving as an Infrastructure as a Service (IaaS) on the host Operating System where the databases are managed, it works closely with the system to insulate it from threats as efficiently as possible. \n\nThis not only would secure the data they have but also ensures the continuity of their operations by preventing potential system downtimes that may stem from cyber attacks. Furthermore, it could save Company XYZ from the reputational and financial losses that may be attached to major data breaches."
    ]
  },
  "Managed": true
}