{
  "ID": "azure_securitycenter_azure_defender_on_for_opensource_relational_db",
  "Title": "Ensure That Microsoft Defender for Open-Source Relational Databases Is Set To 'On'",
  "Description": "Turning on Microsoft Defender for Open-source relational databases enables threat detection for Open-source relational databases, providing threat intelligence, anomaly detection, and behavior analytics in the Microsoft Defender for Cloud.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_subscription_pricing",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_subscription_pricing",
    "QueryToExecute": "select\n  sub_pricing.id as resource,\n  sub_pricing.kaytu_account_id as kaytu_account_id,\n  sub_pricing.kaytu_resource_id as kaytu_resource_id,\n  case\n    when pricing_tier = 'Standard' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when pricing_tier = 'Standard' then 'Azure Defender on for Open Source Relational Databases.'\n    else 'Azure Defender off for Open Source Relational Databases.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_security_center_subscription_pricing sub_pricing\n  right join azure_subscription sub on sub_pricing.subscription_id = sub.subscription_id\nwhere\n  name = 'OpenSourceRelationalDatabases';\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.1.6"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2.1"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "AWS Control enables the setting adjustments of Microsoft Defender for Open-source relational databases. This platform utilizes advanced threat protection and functions to combat potential risks within your cloud-based databases.\n\nWith it enabled, users have the advantages of insightful threat intelligence, competent anomaly detection, and productive behavior analytics. These are all combined in the Microsoft Defender for Cloud, bolstering the security level.\n\nThis control is extremely effective for open-source relational databases, ensuring data safety and integral structure.\n\nHere's a sample of the markup format:\n\n```markdown\n## AWS Control with Microsoft Defender\n\nAWS Control offers customization for activating Microsoft Defender, serving as a robust line of defense for open-source relational databases.\n\n**Key Features:**\n\n- *Threat Intelligence* - Identifies potential threats and provides strategies to combat them.\n\n- *Anomaly Detection* - Recognizes unusual patterns or activities, suggesting the possibilities of a threat.\n\n- *Behavior Analytics* - Analyzes user behavior, flagging any suspicious or malicious activity.\n\nAll these valuable features are integrated into the Microsoft Defender for Cloud, maximizing the overall security of your relational databases. Protect your valuable data with this comprehensive solution.\n```\n\nThe Markdown text provided gives a simple overview of the AWS Control with Microsoft Defender service and its benefits. It uses bullet points to highlight the key features of the service. This includes the benefits that users can gain: threat intelligence, anomaly detection, and behavior analytics. The ending note emphasizes the overall advantages of enabling the service.\n\nPlease remember to adjust this to fit the specific syntax rules of your chosen markdown renderer as different tools may have slightly different ways to represent certain elements.\n"
    ],
    "x-kaytu-noncompliance-cost": [
      "AWS doesn't have a control named \"Turning on Microsoft Defender for Open-source relational databases\". The control referred in the question appears to be from Microsoft Azure, not AWS. Microsoft Defender for Cloud is part of Azure's security services.\n\nIf the query is indeed about Azure, non-compliance to this control can result in several potential risks and costs:\n\n- **Security Vulnerability**: If the Microsoft Defender for Open-source relational databases is not turned on, the databases would be susceptible to security vulnerabilities. This could lead to unauthorized access or other types of security breaches.\n\n- **Data Loss/Manipulation**: A major consequence of these security breaches could be the loss or manipulation of important data stored in the databases. This could be extremely costly depending on the value and sensitivity of the data.\n\n- **Financial Costs**: There could be significant financial implications as a result of a data breach. This could range from fines for non-compliance with regulations, costs to rectify the breach, or compensation to customers or other entities affected by the breach.\n\n- **Reputation Damage**: Breaches could also lead to severe damage to a company's reputation, which can have long-term financial implications and loss of customer trust.\n\n- **Compliance Risks**: Not complying with certain security controls can lead you to non-compliance with regulatory standards (like GDPR, HIPAA, or others) and may result in hefty fines and legal consequences.\n\nIt's important to remember that Microsoft Defender for Cloud is part of a layered security approach and it's most effective when used along with other security controls and practices.\n\nPlease make sure that your question is corrected if it was intended to refer to Azure Defender or another Azure service, or provide more information if you were indeed asking about an AWS service."
    ],
    "x-kaytu-usefulness-example": [
      "AWS Control Example: \n\nLet's say you are managing a company that uses open-source relational databases like MySQL, PostgreSQL, etc., for managing crucial data of your business. It is essential to remain vigilant against any cybersecurity threats that might compromise or misuse your sensitive data. \n\nHere is how you can use the Microsoft Defender for AWS:\n\n```\n1. **Step 1: Enable Microsoft Defender**\n- Go to your AWS Management Console, navigate to Microsoft Defender for Cloud, and turn it on.\n\n2. **Step 2: Set up the environment**\n- Once you turn it on, configure the environment according to your needs and the type of database you are using. This setup includes setting the basic rules, creating policies, and defining threat detection standards.\n\n3. **Step 3: Monitor Threats**\n- Now, the Microsoft Defender will start monitoring your open-source relational databases for any potential threats. It uses advanced behaviour analytics using machine learning, anomaly detection, and threat intelligence to provide comprehensive security. \n- It will analyze the data from your databases, find out anomalies, and alert you if it spots any potential malicious activity.\n\n4. **Step 4: Take Action**\n- If the Microsoft Defender identifies any threat, it will alert you. You can then take immediate action to neutralize the threat and protect your data.\n```\n\nIn essence, turning on and utilizing Microsoft Defender for your Open-source relational databases in AWS will provide an extra layer of security for your critical data. It will leverage advanced threat protection features to help you maintain high standards of data security. The utility of this AWS control becomes even more critical considering the rising cybersecurity threats in today's digital world."
    ]
  },
  "Managed": true
}