{
  "ID": "azure_monitor_log_alert_delete_nsg",
  "Title": "Ensure that Activity Log Alert exists for Delete Network Security Group",
  "Description": "Create an activity log alert for the Delete Network Security Group event.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as (\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id,\n    jsonb_array_length(alert.condition -\u003e 'allOf')\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and (\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Network/networkSecurityGroups/delete\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/networksecuritygroups\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n  limit 1\n)\n  select\n    sub.subscription_id as resource,\n    sub.kaytu_account_id as kaytu_account_id,\n    sub.kaytu_resource_id as kaytu_resource_id,\n    case\n      when count(a.subscription_id) \u003e 0 then 'ok'\n      else 'alarm'\n    end as status,\n    case\n      when count(a.subscription_id) \u003e 0 then 'Activity log alert exists for delete Network Security Group event.'\n      else 'Activity log alert does not exists for delete Network Security Group event.'\n    end as reason\n    \n    , sub.display_name as subscription\n  from\n    azure_subscription sub\n    left join alert_rule a on sub.subscription_id = a.subscription_id\n  group by\n    kaytu_account_id,\n    kaytu_resource_id,\n    sub._ctx,\n    sub.subscription_id,\n    sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.4"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5.2"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "AWS Control Tower in terms of AWS environment, provides guidance to set up and govern a secure multi-account AWS environment. But, the scenario you described entails more to Azure Management security settings rather than AWS.\n\nAzure has a feature named Activity Log Alerts. An activity log alert is created using the Log Search query language and triggers whenever a new record matching the query is produced. The Delete Network Security Group is an operation that can be monitored. \n\nYour scenario can't be performed directly using AWS Control Tower since Amazon Web Services and Azure are different service providers. However, AWS does provide a similar operation. \n\nOn AWS, AWS CloudTrail is used for governance, compliance, operational auditing, and risk auditing of your AWS account, which logs all kinds of API activities. To create an alert for a specified event like deleting a Network Security Group, we usually use Amazon CloudWatch or AWS Config along with it. \n\nFor AWS CloudTrail, here is a brief explanation of setting up the alert in CloudWatch:\n\n```\n{\n    \"source\": [\n        \"aws.ec2\"\n    ],\n    \"detail-type\": [\n        \"AWS API Call via CloudTrail\"\n    ],\n    \"detail\": {\n        \"eventSource\": [\n            \"ec2.amazonaws.com\"\n        ],\n        \"eventName\": [\n            \"DeleteSecurityGroup\"\n        ]\n    }\n}\n```\n\nThis is an event pattern that would match 'DeleteSecurityGroup' events in CloudWatch. \n\nPlease note that AWS has several other services to monitor and alert API activities, it may vary according to your requirements and policies provisioned for your AWS environment."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to the AWS control that stipulates creating an activity log for a \"Delete Network Security Group\" event could lead to significant costs and implications. \n\n1. **Loss of Visibility and Traceability**: Without the establishment of an activity log alert for such critical actions, it becomes challenging to trace who did what and when. This lack of visibility over actions taken can potentially cost an organization in terms of security as it may fail to identify malicious insiders or security breaches on time. \n\n2. **Security Risks**: The absence of an alert very likely increases vulnerability to security threats. Network Security Groups are important as they control inbound and outbound traffic. A deletion of a Network Security Group may remove certain restrictions and open up your resources to potential attacks.\n\n3. **Regulatory Penalties**: If you're in an industry that demands adherence to specific security protocols and practices (like PCI DSS, HIPAA, or GDPR), non-compliance to regulations due to lack of necessary alerts and logs could result in hefty fines and penalties. \n\n4. **Potential Business Disruption**: If a critical security group is deleted without an alert, it might not be detected until a service or application disruption is noticed. This could lead to downtime and a subsequent loss in business or customer trust.\n\n5. **Recovery Costs**: In the event of a security breach arising from the unauthorized deletion of a Network Security Group, your organization may need to invest in incident response, forensics, system recovery, and a wide range of other activities mandated by incident management protocol.\n\nAdherence to this control would prevent unauthorized changes, improve the ability to perform audits, and aid incident response capabilities."
    ],
    "x-kaytu-usefulness-example": [
      "Example:\n\nIn a scenario where you are working with a team of cloud engineers managing a production environment with a large number of entities on AWS, log monitoring becomes critical. \n\nFor instance, there could be a Network Security Group (NSG) that controls inbound and outbound traffic for services, which if accidentally deleted can cause significant disruption to the system. \n\nTo prevent such situations, you can create an activity log alert for the `Delete Network Security Group` event. This AWS control will trigger an alert when someone attempts to delete the NSG, this alert could be sent through email or any messaging platform that your team uses. \n\nIn addition to notifying, this alert could also automatically enforce a policy that prevents the NSG from being deleted, ensuring minimal downtime and consistent security of your cloud environment. So, in this way, an activity alert for `Delete Network Security Group` event can provide valuable information to administrators about potential important changes in the security settings of your AWS resources.\n\n```\n# Example in AWS CloudWatch Events\n```yaml\n{\n    \"source\": [\n        \"aws.ec2\"\n    ],\n    \"detail-type\": [\n        \"AWS API Call\"\n    ],\n    \"detail\": {\n        \"eventSource\": [\n            \"ec2.amazonaws.com\"\n        ],\n        \"eventName\": [\n            \"DeleteSecurityGroup\"\n        ]\n    }\n}\n```\nWith this control, you can define an action to be taken when the `DeleteNetworkSecurityGroup` event occurs, such as triggering a Lambda function to send an alert message or revert the action."
    ]
  },
  "Managed": true
}