{
  "ID": "azure_securitycenter_azure_defender_on_for_dns",
  "Title": "Ensure That Microsoft Defender for DNS Is Set To 'On'",
  "Description": "Microsoft Defender for DNS scans all network traffic exiting from within a subscription.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_subscription_pricing",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_subscription_pricing",
    "QueryToExecute": "select\n  sub_pricing.id as resource,\n  sub_pricing.kaytu_account_id as kaytu_account_id,\n  sub_pricing.kaytu_resource_id as kaytu_resource_id,\n  case\n    when pricing_tier = 'Standard' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when pricing_tier = 'Standard' then 'Azure Defender on for DNS.'\n    else 'Azure Defender off for DNS.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_security_center_subscription_pricing sub_pricing\n  right join azure_subscription sub on sub_pricing.subscription_id = sub.subscription_id\nwhere\n  name = 'Dns';\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.1.11"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2.1"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "Microsoft Defender for DNS is not an AWS service but a security feature provided by Microsoft. However, if we are to consider a NAT Gateway or Network Firewall in AWS Infrastructure monitoring network traffic, it might look something like the statement below:\n\n```markdown\n**AWS NAT Gateway/ Network Firewall for DNS Protection**\n\nAWS NAT Gateway or Network Firewall can help control network traffic exiting from within a subscription. This service can monitor and potentially restrict any network traffic from your AWS resources, as per your configuration. \n\nWith integrated security measures, these services can help prevent any harmful or unwanted network entities from communicating with your infrastructure, similar to the functionality offered by Microsoft Defender for DNS in scanning all network traffic.\n\nSo, whether you're dealing with web traffic or DNS requests, AWS NAT Gateway or Network Firewall can provide the needed visibility and control over your network traffic.\n```\n\nRemember, the details will depend on the particular AWS service you're using, and the actual configuration might involve more nuanced steps, including setting up extra security groups, access control lists, or other security measures."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with an AWS control such as the DNS scanning with Microsoft Defender can result in considerable costs. The most significant cost is related to the security risks that remain unaddressed; these can include:\n\n1. **Increase in Vulnerability to Attacks:**\nNon-compliance to this DNS scanning control can leave the system vulnerable to multiple cyber attacks like DNS Poisoning, DNS tunneling, or DNS Hijacking. These types of attacks can lead to theft of sensitive data, interrupted services, or loss of customer trust.\n\n2. **Financial Loses due to Breach:**\nIn case of a successful cyber-attack, the financial losses can be significant. These can include the cost of the immediate response (including overtime for IT staff), potential loss of sales, damage to brand reputation and client relations, as well as potential lawsuits which can result in heavy legal costs.\n\n3. **Penalties and Fines:**\nNon-compliance can also lead to potential penalties and fines from regulatory authorities. In certain industries, such as healthcare or finance, regulations can dictate specific requirements for security controls. Non-compliance can lead to significant fines and penalties from the respective regulatory bodies.\n\n4. **Reduced Marketplace Trust:**\nFailure to comply with security controls could lead to reduced trust from customers and partners. This can lead to decreased revenue as customers shift to competitors who they perceive as more secure, and as partnerships dissolve due to perceived insecurity.\n\nIn summary, it's not just the out-of-pocket costs an organization should be concerned with in the case of non-compliance with AWS controls. The long-term impact to the organization's reputation and customer trust can be even more devastating."
    ],
    "x-kaytu-usefulness-example": [
      "The AWS control of the Microsoft Defender for DNS provides an additional layer of security for the system by scanning all network traffic. This can be particularly beneficial in a variety of instances, such as a cloud-based company storing sensitive client data.\n\n##### Example Instance\nImagine a financial technology (Fintech) company which manages daily transactions and sensitive financial data of thousands of clients. They use AWS cloud services for their computing needs including database management, application deployment, and data storage.\n\n1. **Protection Against Malware Attacks:**\nMicrosoft Defender for DNS, in this case, scans all network traffic exiting from their system, identifying and notifying potential threats, like malware attacks aiming to infiltrate the system and steal confidential data. \n\n    ```markup\n    \u003cAWSControl\u003e\n       \u003cMicrosoftDefender\u003e\n          \u003cAction\u003eScan\u003c/Action\u003e\n          \u003cTarget\u003eNetworkTraffic\u003c/Target\u003e\n       \u003c/MicrosoftDefender\u003e\n    \u003c/AWSControl\u003e\n    ```\n\n2. **Detecting Data Breaches:**\nAdditionally, unusual data transfer or large data requests are identified by these scans. This could potentially represent data breaches, where unauthorized users may be trying to siphon off the client's info stored in the cloud system. Prompt notification allows The Fintech company to prevent any potential breaches.\n\n    ```markup\n    \u003cAWSControl\u003e\n       \u003cMicrosoftDefender\u003e\n         \u003cAction\u003eDetect\u003c/Action\u003e\n         \u003cTarget\u003eDataBreaches\u003c/Target\u003e\n       \u003c/MicrosoftDefender\u003e\n    \u003c/AWSControl\u003e\n    ```\n\n    Hence, having Microsoft Defender for DNS as an implemented AWS control is likely to be extremely beneficial in maintaining the security and efficiency of this company."
    ]
  },
  "Managed": true
}