{
  "ID": "azure_network_virtual_network_gateway_no_basic_sku",
  "Title": "Virtual network gateways should use standard SKUs as a minimum",
  "Description": "The use of Basic or Free SKUs in Azure whilst cost effective have significant limitations in terms of what can be monitored and what support can be realized from Microsoft. Typically, these SKU’s do not have a service SLA and Microsoft will usually refuse to provide support for them. Consequently Basic/Free SKUs should never be used for production workloads.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_subscription",
      "azure_virtual_network_gateway"
    ],
    "PrimaryTable": "azure_virtual_network_gateway",
    "QueryToExecute": "select\n  g.id as resource,\n  g.kaytu_account_id as kaytu_account_id,\n  g.kaytu_resource_id as kaytu_resource_id,\n  case\n    when g.sku_name = 'Basic' then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when g.sku_name = 'Basic' then g.title || ' using basic SKU.'\n    else g.title || ' using ' || sku_name || ' SKU.'\n  end as reason\n  \n  , g.resource_group as resource_group\n  , sub.display_name as subscription\nfrom\n  azure_virtual_network_gateway as g,\n  azure_subscription as sub\nwhere\n  sub.subscription_id = g.subscription_id;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "cis": [
      "true"
    ],
    "service": [
      "Azure/Network"
    ],
    "x-kaytu-explanation": [
      "Azure SKUs or Stock Keeping Units refer to the different variations or types of Azure products or services, like different plans or levels of service in Azure. The two mentioned here - Basic and Free SKUs - are generally cheaper or cost-free options provided by Azure, usually used by developers or companies for testing or development purposes due to their cost-effectiveness.\n\nThis segment is stating that while Basic or Free SKUs can be beneficial due to their low costs, they offer limited features in terms of monitoring capabilities, and have limited support from Microsoft, both integral for maintaining and troubleshooting in production or live environments. Furthermore, these SKU's typically do not come with a Service Level Agreement (SLA) which contains the terms and guarantees provided by Microsoft about their product/ service's availability and performance.\n\nAs Microsoft generally does not offer support for Basic/Free SKUs, they aren't recommended for production workloads, or live environments serving real users or customers. It's because any issues or service disruptions can potentially affect the business operations and may not be immediately or adequately resolved due to lack of support and SLA."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with this Azure Control can result in several potential disadvantages:\n\n1. **Limited Monitoring:** Basic or Free SKUs only offer limited monitoring capabilities. Monitoring is critical for ensuring application availability, performance, and security, enabling quick responses to any issues or abnormalities. So, this limited monitoring capability might affect your ability to maintain high-level operational performance.\n\n2. **No Service Level Agreement (SLA):** SLAs define the level of service you can expect from a service provider, such as guaranteed uptime or response times for support queries. Without an SLA, you don't have any guarantees about the availability or stability of your workloads. This could lead to business interruptions, which might negatively impact your reputation or lead to the loss of customers or revenue.\n\n3. **No Microsoft Support:** When using Basic or Free SKUs, Microsoft usually won't provide support services. This could result in extended downtime or other operational problems if any issues arise and you cannot resolve them independently.\n\n4. **Unsuitable for Production Workloads:** Basic or Free SKUs aren't suitable for production workloads because they don't offer the necessary stability, performance, or support. Using these SKUs for production workloads can, therefore, lead to poor application performance or even critical failures.\n\nIn summary, non-compliance to this Azure Control can risk operational performance, application availability, and increases the potential monetary damage due to disruptions, time taken to isolate and resolve issues, and possibly failure to meet customer obligations. Moreover, it may impact customer trust and business reputation, the cost of which is immeasurable."
    ],
    "x-kaytu-usefulness-example": [
      "Azure Control offers various pricing tiers that cater to different business needs and budges, such as Basic, General Purpose, Memory Optimized, and others. Each tier offers specific features and performance capabilities. Although the Basic and Free SKUs are very cost-effective, they have significant limitations. They do not have a service-level agreement (SLA), which means Microsoft does not offer support for them. \n\nFor example, let's suppose you're a small business experimenting with Azure for the first time, and you choose to start with a Basic SKU to study the environment and get familiar with the functionalities. You're developing an application and you use the Basic SKU to host your initial versions and for testing purposes since it's a less expensive choice. In this scenario, the Basic SKU serves your needs perfectly.\n\nHowever, as your business and customer base starts to grow, your requirements change. You need more storage, better performance, high availability, and most importantly, you need professional support from Microsoft. But, the Basic SKU does not provide these features.\n\nIn conclusion, although Basic/Free SKUs are economically attractive, they are not suitable for production environments due to their inherent limitations. Therefore, careful consideration should be given when choosing the ideal SKU for your needs, taking into account not only cost but also the capabilities and support offered."
    ]
  },
  "Managed": true
}