{
  "ID": "azure_securitycenter_wdatp_integration",
  "Title": "Ensure that Windows Defender ATP (WDATP) integration with Security Center is selected",
  "Description": "This setting enables Windows Defender ATP (WDATP) integration with Security Center.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_setting",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_setting",
    "QueryToExecute": "select\n  sc_sett.id as resource,\n  sc_sett.kaytu_account_id as kaytu_account_id,\n  sc_sett.kaytu_resource_id as kaytu_resource_id,\n  case\n    when enabled then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when enabled then 'Microsoft Cloud App Security (MCAS) integrated with Security Center.'\n    else 'Microsoft Cloud App Security (MCAS) not integrated with Security Center.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_security_center_setting sc_sett\n  right join azure_subscription sub on sc_sett.subscription_id = sub.subscription_id\nwhere\n  name = 'WDATP';\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.9"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "`Windows Defender ATP Integration` is a key control in AWS (Amazon Web Services) Security Center for enhancing the security of servers operated using Microsoft Windows. \n\n```markdown\n# Windows Defender ATP Integration\n\nThe `Windows Defender ATP Integration` in AWS Security Center is used for linking your Microsoft Windows Defender Advanced Threat Protection (WDATP) to AWS Security Center. \n\nWindows Defender ATP is a unified platform for preventative protection, post-breach detection, automated investigation, and response. It helps to detect, investigate, and stop advanced cyberattacks and data breaches on your Windows-based servers. \n\nOnce this integration is established, AWS Security Center can display threat and vulnerability management data from Windows Defender ATP, providing you more insights into potential threats impacting your AWS resources.\n\nTo enable this setting:\n\n1. Go to the AWS Security Center.\n2. Locate the Windows Defender ATP Integration.\n3. Follow the instructions to connect AWS Security Center with your Windows Defender ATP.\n\nBy enabling this integration, you can leverage cloud intelligence with the help of AWS to guard your Microsoft Windows servers against potential threats.\n```\nPlease ensure to keep your Windows Defender ATP up-to-date for optimal performance and protection."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with the control that enables Windows Defender ATP (WDATP) integration with Security Center could result in costly consequences for an organization on AWS. These are the primary cost implications:\n\n1. **Increased Security Risks:** Without the WDATP integration, your environment may be more susceptible to threats because you lack centralized monitoring and management capabilities for Windows Defender, reducing your overall protection level.\n\n2. **Delayed Threat Detection and Response:** The lack of unified visibility for security alerts would likely slow the detection and response to security incidents, which could enlarge the impact of a security breach.\n\n3. **Operational Inefficiency:** Without integration, your IT team might need to manually correlate event information from different services, increasing workload and reducing operational efficiency. \n\n4. **Compliance Violations and Potential Fines:** If your organization is subject to regulations requiring specific security controls, non-compliance with this setting could violate regulations and result in substantial fines and penalties, as well as reputational damage.\n\n5. **Forensic Costs:** In the event of a security breach, without necessary auditing and logging enabled through WDATP, the forensic analysis becomes more difficult and time-consuming, thus increasing its cost.\n\nEach of these cost implications should be considered within the context of your specific security needs and compliance requirements. It's important to weigh the risks and costs of non-compliance against the resources required for compliance."
    ],
    "x-kaytu-usefulness-example": [
      "When dealing with cloud-based workloads, maintaining strong and updated security protocols is essential. The AWS Control for integrating Windows Defender ATP (WDATP) with Security Center could be a useful capability in an instance where a business relies heavily on Windows-based servers and technologies.\n\nFor example, if your organization hosts a web application on a cluster of Windows servers on AWS cloud, this setting could be extremely beneficial. If a potential threat or security vulnerability is detected, WDATP can automatically alert the Security Center. This would allow quick response and remediation to the security threat.\n\nBy integrating WDATP with Security Center, emergent threats can be mitigated effectively in real-time, thereby combating potential data breaches or shutdowns. This results in better trust from customers and less potential loss of revenue due to threats and breaches. \n\nIn terms of maintaining compliance with various regulatory standards, this integration also proves useful. Many regulatory standards require rapid response to security threats, which this AWS Control setting facilitates.\n\nHere's an example in markup:\n\n```\n{\n    \"AWS_Control_Setting\": {\n        \"Control_Setting_Name\": \"Enable Windows Defender ATP Integration\",\n        \"Enable\": true,\n        \"Description\": \"This setting enables integration between Windows Defender Advanced Threat Protection (WDATP) and AWS Security Center, enhancing real-time response to detected threats, maintaining customer trust, and regulatory compliance.\"\n    }\n}\n```"
    ]
  },
  "Managed": true
}