{
  "ID": "azure_securitycenter_azure_defender_on_for_sqldb",
  "Title": "Ensure that Azure Defender is set to On for Azure SQL database servers",
  "Description": "Turning on Azure Defender enables threat detection for Azure SQL database servers, providing threat intelligence, anomaly detection, and behavior analytics in the Azure Security Center.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_security_center_subscription_pricing",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_security_center_subscription_pricing",
    "QueryToExecute": "select\n  sub_pricing.id as resource,\n  sub_pricing.kaytu_account_id as kaytu_account_id,\n  sub_pricing.kaytu_resource_id as kaytu_resource_id,\n  case\n    when pricing_tier = 'Standard' then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when pricing_tier = 'Standard' then 'Azure Defender on for SQL database servers.'\n    else 'Azure Defender off for SQL database servers.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_security_center_subscription_pricing sub_pricing\n  right join azure_subscription sub on sub_pricing.subscription_id = sub.subscription_id\nwhere\n  name = 'SqlServers';\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "low",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.3"
    ],
    "cis_level": [
      "2"
    ],
    "cis_section_id": [
      "2"
    ],
    "cis_type": [
      "manual"
    ],
    "cis_version": [
      "v1.3.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/SecurityCenter"
    ],
    "x-kaytu-explanation": [
      "**Azure Control: Turning on Azure Defender for Azure SQL Database Servers**\n\nEnabling Azure Defender enhances the security posture of Azure SQL database servers by activating advanced threat detection capabilities. This feature is integrated into the Azure Security Center, offering a comprehensive set of security measures.\n\n**Features:**\n- *Threat Intelligence:* Azure Defender leverages threat intelligence to identify and respond to known attack patterns, providing proactive defense against a wide range of security threats.\n\n- *Anomaly Detection:* The system employs anomaly detection mechanisms to identify unusual or suspicious activities within the Azure SQL database environment. This helps in early detection of potential security incidents.\n\n- *Behavior Analytics:* Azure Defender utilizes behavior analytics to analyze patterns of user and system behavior. By identifying deviations from normal behavior, it enhances the ability to detect and respond to security threats effectively.\n\n**Integration with Azure Security Center:**\nThe Azure Defender for Azure SQL Database Servers is seamlessly integrated into the Azure Security Center. This integration allows for centralized management and monitoring of security controls, providing a unified interface for administrators.\n\n**Benefits:**\n- Improved Threat Detection: Enhances the ability to detect and respond to security threats with advanced threat intelligence and analytics.\n\n- Centralized Security Management: Streamlines security management through integration with the Azure Security Center, providing a single pane of glass for monitoring and control.\n\n**How to Enable:**\nTo activate Azure Defender for Azure SQL Database Servers, navigate to the Azure Security Center and follow the provided instructions for enabling this advanced threat detection feature.\n\n*Note: Continuous monitoring and periodic review of security configurations are recommended to ensure ongoing effectiveness of Azure Defender for Azure SQL Database Servers.*\n"
    ],
    "x-kaytu-noncompliance-cost": [
      "### Azure Security Control: Azure Defender for Azure SQL Database Servers\n\n**Description:**\nTurning on Azure Defender is crucial for enhancing the security posture of Azure SQL database servers. It facilitates advanced threat detection by leveraging threat intelligence, anomaly detection, and behavior analytics within the Azure Security Center.\n\n**Cost of Non-Compliance:**\nFailure to enable Azure Defender for Azure SQL database servers may result in increased vulnerability to various cyber threats. Without the added layer of threat detection and intelligence provided by Azure Defender, the organization exposes itself to the following risks:\n\n- **Unidentified Threats:** Potential security threats and attacks may go unnoticed, leading to unauthorized access, data breaches, or other malicious activities.\n  \n- **Lack of Anomaly Detection:** An absence of anomaly detection means abnormal activities or patterns indicative of a security incident may not be flagged, allowing threats to persist undetected.\n\n- **Limited Behavior Analytics:** Without leveraging behavior analytics, the system may struggle to identify and respond to unusual user behaviors or deviations from normal patterns, reducing the ability to proactively mitigate risks.\n\n**Recommendation:**\nTo mitigate these risks and enhance the security posture of Azure SQL database servers, it is highly recommended to enable Azure Defender. This ensures comprehensive threat detection capabilities, empowering organizations to identify and respond to security incidents promptly.\n\n**Implementation Steps:**\n1. Access the Azure Security Center.\n2. Navigate to the settings for Azure Defender.\n3. Enable Azure Defender for Azure SQL database servers.\n\nBy following these steps, organizations can proactively protect their Azure SQL database servers and strengthen their overall security infrastructure.\n"
    ],
    "x-kaytu-usefulness-example": [
      "# Enable Azure Defender for Azure SQL Database Servers\n\n## Description\nTurning on Azure Defender enhances the security posture of Azure SQL database servers by enabling advanced threat detection features. This includes threat intelligence, anomaly detection, and behavior analytics, all of which contribute to a more robust security framework within the Azure Security Center.\n\n## Usage Instructions\n\nTo activate Azure Defender for your Azure SQL database servers, follow these steps:\n\n1. Navigate to the Azure Portal: [https://portal.azure.com](https://portal.azure.com).\n\n2. Select the target Azure SQL database server from the Azure Dashboard.\n\n3. In the left navigation pane, click on \"Security\" to access the security settings for the selected database server.\n\n4. Within the Security settings, locate and click on the \"Azure Defender\" option.\n\n5. Toggle the switch to enable Azure Defender for the Azure SQL database server.\n\n6. Save your changes.\n\nOnce Azure Defender is enabled, the system will start leveraging threat intelligence, anomaly detection, and behavior analytics to enhance the detection capabilities and overall security of your Azure SQL database servers.\n\n> Note: It is recommended to regularly review security alerts and recommendations in the Azure Security Center to stay informed about potential threats and take necessary actions to mitigate risks.\n"
    ]
  },
  "Managed": true
}