{
  "ID": "azure_monitor_log_alert_delete_public_ip_address",
  "Title": "Ensure that Activity Log Alert exists for Delete Public IP Address rule",
  "Description": "Create an activity log alert for the Delete Public IP Address rule.",
  "Query": {
    "Connector": "Azure",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "azure_log_alert",
      "azure_subscription"
    ],
    "PrimaryTable": "azure_log_alert",
    "QueryToExecute": "with alert_rule as(\n  select\n    alert.id as alert_id,\n    alert.name as alert_name,\n    alert.enabled,\n    alert.location,\n    alert.subscription_id\n  from\n    azure_log_alert as alert,\n    jsonb_array_elements_text(scopes) as sc\n  where\n    alert.location = 'Global'\n    and alert.enabled\n    and sc = '/subscriptions/' || alert.subscription_id\n    and\n    (\n      ( alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n      and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/publicipaddresses\"}]'\n      and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"operationName\", \"equals\": \"Microsoft.Network/publicIPAddresses/delete\"}]'\n      )\n      or\n      (\n        alert.condition -\u003e 'allOf' @\u003e '[{\"equals\":\"Administrative\",\"field\":\"category\"}]'\n        and alert.condition -\u003e 'allOf' @\u003e '[{\"field\": \"resourceType\", \"equals\": \"microsoft.network/publicipaddresses\"}]'\n        and jsonb_array_length(alert.condition -\u003e 'allOf') = 2\n      )\n    )\n    limit 1\n)\nselect\n  sub.subscription_id as resource,\n  sub.kaytu_account_id as kaytu_account_id,\n  sub.kaytu_resource_id as kaytu_resource_id,\n  case\n    when count(a.subscription_id) \u003e 0 then 'ok'\n    else 'alarm'\n  end as status,\n  case\n    when count(a.subscription_id) \u003e 0 then 'Activity Log Alert exists for Delete Public IP Address rule.'\n    else 'Activity Log Alert does not exists for Delete Public IP Address rule.'\n  end as reason\n  \n  , sub.display_name as subscription\nfrom\n  azure_subscription sub\n  left join alert_rule a on sub.subscription_id = a.subscription_id\ngroup by\n  sub.kaytu_account_id,\n  sub.kaytu_resource_id,\n  sub._ctx,\n  sub.subscription_id,\n  sub.display_name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "medium",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "5.2.10"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "5"
    ],
    "cis_type": [
      "automated"
    ],
    "cis_version": [
      "v1.5.0"
    ],
    "plugin": [
      "azure"
    ],
    "service": [
      "Azure/Monitor"
    ],
    "x-kaytu-explanation": [
      "`AWS CloudTrail` lets you log, continuously monitor, and retain account activity related to actions across your AWS infrastructure. You can create an activity log alert for the `Delete Public IP Address` rule in AWS using `Amazon CloudWatch`. Here is the markup format:\n\n```markdown\n# Creating an Activity Log Alert for 'Delete Public IP Address' Rule in AWS\n\nFollow these steps to set up the alert:\n\n1. **Log in to your AWS Console**: Access your AWS Management Console and navigate to the 'CloudWatch' service.\n\n2. **Create New Alarm**: Once in CloudWatch, move to 'Alarms' -\u003e 'Create Alarm'.\n\n3. **Select Metric**: In the 'Create Alarm' wizard, go to 'Select metric' -\u003e 'CloudTrail' -\u003e 'Event count'. Choose the 'Event count' metric.\n\n4. **Configure Alarm**: Set up the conditions for your alarm. You would need to enter 'Delete Public IP Address' for the 'Event name'. Set the threshold values according to your requirements.\n\n5. **Create a new topic for Alarm Action**: Define what actions need to be taken when your alarm changes state. Create a new topic for this, enter an appropriate topic name and email id to receive the notifications.\n\n6. **Add a Name and Description**: Finally, name your alarm and add a description to remember what this specific alarm is for.\n\n7. **Review and Create**: Review all your configurations and click on 'Create Alarm'.\n\nNow, whenever there is an event where a Public IP Address is deleted, AWS will send an alert to the email address you specified.\n```\nThe above steps are general steps to create an alert for the Delete Public IP Address rule. The specifics might vary a little based on your individual requirements and existing setup, but should provide a good first step for setting up such alerts."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to this AWS control which suggests creating an activity log alert for the Delete Public IP Address rule could have several costly consequences. Here are some:\n\n1. **Loss of valuable data**: Public IP addresses are associated with running instances and certain AWS services. Unmonitored deletion of public IP addresses could lead to loss of access to these instances or services, which could potentially lead to loss of valuable data.\n\n2. **Security risks**: Without a log alert in place, unauthorized or accidental deletions could go unnoticed, leaving the system open to potential security risks. An attacker can remove a public IP address to disrupt the service or mask unauthorized activities.\n\n3. **Operational Disruption**: If a public IP address is deleted without prior intimation, it can cause an unexpected disruption in the services or operations associated with that IP. The consequences can be severe, depending on how critical the services affected are.\n\n4. **Increased costs**: AWS charges for each public IP address that is not associated with a running instance. If deletion of Public IPs is not monitored, there could be financial implications due to inappropriate or inefficient resource allocation. Moreover, the tasks of identifying, diagnosing and rectifying these unnecessary deletions would require additional resources and man-hours, which adds to the cost.\n\n5. **Non-compliant with regulations**: Depending on the nature of your business, not having appropriate alerting in place may make your system non-compliant with certain data protection or privacy regulations, potentially resulting in fines or sanctions.\n\nThe activity log alerts are therefore not merely about getting notifications but they serve as an important compliance and security strategy in AWS resource management."
    ],
    "x-kaytu-usefulness-example": [
      "Activity log alerts can provide monitoring and notifications on specific activities or operations in your environment, such as deleting a public IP address. \n\nFor example:\n\nImagine you're an administrator for an application that is hosted on AWS and is used by a large number of users. Within your environment, you've assigned a public IP address to your application's server to enable public accessibility. This public IP address is embedded in codes, databases, and shared with customers. An unintentional or malicious deletion of the public IP address can lead to a total outage of your application since it would no longer accessible from the public internet.\n\nBy having an activity log alert set for the 'Delete Public IP Address' rule, you'll be notified immediately when such an event occurs. This way you can quickly perform troubleshooting actions, such as reassigning a new public IP address and updating your application's configurations.\nThis is a crucial AWS control for preventing inadvertent changes that can lead to system downtime and for maintaining the security and accessibility of your AWS environment."
    ]
  },
  "Managed": true
}