{
  "ID": "aws_s3_bucket_enforces_ssl",
  "Title": "S3 buckets should enforce SSL",
  "Description": "To help protect data in transit, ensure that your Amazon Simple Storage Service (Amazon S3) buckets require requests to use Secure Socket Layer (SSL).",
  "Query": {
    "Connector": "AWS",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "aws_s3_bucket"
    ],
    "PrimaryTable": "aws_s3_bucket",
    "QueryToExecute": "with ssl_ok as (\n  select\n    distinct name,\n    arn,\n    'ok' as status\n  from\n    aws_s3_bucket,\n    jsonb_array_elements(policy_std -\u003e 'Statement') as s,\n    jsonb_array_elements_text(s -\u003e 'Principal' -\u003e 'AWS') as p,\n    jsonb_array_elements_text(s -\u003e 'Action') as a,\n    jsonb_array_elements_text(s -\u003e 'Resource') as r,\n    jsonb_array_elements_text(\n      s -\u003e 'Condition' -\u003e 'Bool' -\u003e 'aws:securetransport'\n    ) as ssl\n  where\n    p = '*'\n    and s -\u003e\u003e 'Effect' = 'Deny'\n    and ssl :: bool = false\n)\nselect\n  b.arn as resource,\n  b.kaytu_account_id as kaytu_account_id,\n  b.kaytu_resource_id as kaytu_resource_id,\n  case\n    when ok.status = 'ok' then 'ok'\n    else 'alarm'\n  end status,\n  case\n    when ok.status = 'ok' then b.name || ' bucket policy enforces HTTPS.'\n    else b.name || ' bucket policy does not enforce HTTPS.'\n  end reason\n  \n  , b.region, b.account_id\nfrom\n  aws_s3_bucket as b\n  left join ssl_ok as ok on ok.name = b.name;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis_controls_v8_ig1": [
      "true"
    ],
    "cisa_cyber_essentials": [
      "true"
    ],
    "fedramp_low_rev_4": [
      "true"
    ],
    "fedramp_moderate_rev_4": [
      "true"
    ],
    "ffiec": [
      "true"
    ],
    "gdpr": [
      "true"
    ],
    "gxp_21_cfr_part_11": [
      "true"
    ],
    "hipaa_final_omnibus_security_rule_2013": [
      "true"
    ],
    "hipaa_security_rule_2003": [
      "true"
    ],
    "nist_800_171_rev_2": [
      "true"
    ],
    "nist_800_53_rev_4": [
      "true"
    ],
    "nist_800_53_rev_5": [
      "true"
    ],
    "nist_csf": [
      "true"
    ],
    "pci_dss_v321": [
      "true"
    ],
    "plugin": [
      "aws"
    ],
    "rbi_cyber_security": [
      "true"
    ],
    "service": [
      "AWS/S3"
    ],
    "soc_2": [
      "true"
    ],
    "x-kaytu-explanation": [
      "# AWS Control: Securing Data Transmission with SSL in Amazon S3\n\n## Overview\n\nThis control focuses on fortifying the security of your Amazon Simple Storage Service (Amazon S3) by enforcing the use of Secure Socket Layer (SSL) for all requests. This measure helps to protect the data exchanged between your storage buckets and the requestor from being intercepted or tampered with.\n\n## Benefits\n\nBy forcing requests to Amazon S3 buckets to use SSL, the data in transit is protected through encryption. This means if a hacker tries intercepting the networking path between your device and Amazon’s data centers, they would only see garbled characters instead of the meaningful data.\n\n## Implementation \n\nTo implement this control, you have to configure an S3 Bucket policy that denies all the non-SSL requests. This way, all clients communicating with your S3 bucket will be required to use HTTPS, ensuring your data remains secure during transmission.\n\nRemember that while this measure drastically improves your data security by protecting it in transit, it doesn't replace a comprehensive security strategy for all layers of your AWS environment. Other layers, such as restricting access privileges and regularly auditing your environment, need to be addressed as well. \n\nThis HTTPs requirement ensures, at a minimum level, that sensitive data being transferred cannot be read or tampered with as it moves across networks, which aligns with industry-standard practices."
    ],
    "x-kaytu-noncompliance-cost": [
      "The cost of non-compliance can be understood in terms of potential risks and impacts to your organization. If your Amazon S3 buckets do not require requests to use Secure Socket Layer (SSL), then this implies that your data is being transmitted insecurely over the network. This exposes your data to several potential risks:\n\n- **Data Breach:** Without encryption, your data could be intercepted and read by unauthorized individuals during transit. This could lead to data breaches where sensitive information might be exposed.\n\n- **Man-in-the-middle Attacks:** SSL is vital to prevent man-in-the-middle attacks where an attacker secretly relays and alters the communication between two parties who believe they are directly communicating with each other.\n\n- **Reputation and Trust:** In the event of a data breach due to non-compliance, the reputation of your organization might suffer. This can also diminish the trust between your organization and its customers, partners, or stakeholders.\n\n- **Legal Consequences:** Depending on the nature and severity of the data breach, and any related government data protection regulations, your organization could face stiff penalties and legal consequences.\n\n- **Loss of Business:** In some cases, data breaches could lead to loss of business. Depending on what data is exposed, customers may decide to switch to another service, ultimately affecting your revenues.\n\nHence, non-compliance to this control could incur substantial costs to your organization in the form of potential data breaches, damage to your reputation, legal consequences, and potential loss of business. It's always recommended to comply with such controls and keep your data secure at all times."
    ],
    "x-kaytu-usefulness-example": [
      "Example:\n\nJohn has created an application that stores user data, including personally identifiable information (PII) such as name, date of birth and social security number in Amazon S3 buckets. He understands that this sensitive data MUST be highly secured during transmission to prevent data breaches.\n\nTo enhance the security measures, he ensures that SSL is required for all requests to S3. Therefore, when the application sends a request to upload or retrieve data from the S3 bucket, the transmission is encrypted and secured via SSL. This prevents potential sensitive data exposure to malicious entities if intercepted during the transit. Here is how he configures it in the S3 bucket policy:\n\n```\n{\n    \"Version\": \"2012-10-17\",\n    \"Id\": \"RequireSSLExample\",\n    \"Statement\": [\n        {\n            \"Sid\": \"RequireSSL\",\n            \"Effect\": \"Deny\",\n            \"Principal\": \"*\",\n            \"Action\": \"s3:*\",\n            \"Resource\": \"arn:aws:s3:::your_bucket_name_here/*\",\n            \"Condition\": {\n                \"Bool\": {\n                    \"aws:SecureTransport\": \"false\"\n                }\n            }\n        }\n    ]\n}\n```\n\nWith this policy, any HTTP request to the bucket without SSL is automatically denied, thereby providing an extra layer of data security on S3."
    ]
  },
  "Managed": true
}