{
  "ID": "aws_cloudtrail_bucket_not_public",
  "Title": "Ensure the S3 bucket used to store CloudTrail logs is not publicly accessible",
  "Description": "CloudTrail logs a record of every API call made in your AWS account. These logs file are stored in an S3 bucket. It is recommended that the bucket policy, or access control list (ACL), applied to the S3 bucket that CloudTrail logs to prevents public access to the CloudTrail logs.",
  "Query": {
    "Connector": "AWS",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "aws_cloudtrail_trail",
      "aws_s3_bucket"
    ],
    "PrimaryTable": "aws_cloudtrail_trail",
    "QueryToExecute": "with public_bucket_data as (\n-- note the counts are not exactly CORRECT because of the jsonb_array_elements joins,\n-- but will be non-zero if any matches are found\nselect\n  t.s3_bucket_name as name,\n  b.arn,\n  t.region,\n  t.account_id,\n  t.tags,\n  t.kaytu_account_id as kaytu_account_id,\n  t.kaytu_resource_id as kaytu_resource_id,\n  t._ctx,\n  count(acl_grant) filter (where acl_grant -\u003e 'Grantee' -\u003e\u003e 'URI' like '%acs.amazonaws.com/groups/global/AllUsers') as all_user_grants,\n  count(acl_grant) filter (where acl_grant -\u003e 'Grantee' -\u003e\u003e 'URI' like '%acs.amazonaws.com/groups/global/AuthenticatedUsers') as auth_user_grants,\n  count(s) filter (where s -\u003e\u003e 'Effect' = 'Allow' and  p = '*' ) as anon_statements\nfrom\n  aws_cloudtrail_trail as t\nleft join aws_s3_bucket as b on t.s3_bucket_name = b.name\nleft join jsonb_array_elements(acl -\u003e 'Grants') as acl_grant on true\nleft join jsonb_array_elements(policy_std -\u003e 'Statement') as s  on true\nleft join jsonb_array_elements_text(s -\u003e 'Principal' -\u003e 'AWS') as p  on true\ngroup by\n  t.s3_bucket_name,\n  b.arn,\n  t.region,\n  t.account_id,\n  t.tags,\n  t.kaytu_account_id,\n  t.kaytu_resource_id,\n  t._ctx\n)\nselect\n  kaytu_account_id as kaytu_account_id,\n  kaytu_resource_id as kaytu_resource_id,\n  case\n    when arn is null then 'arn:aws:s3::' || name\n    else arn\n  end as resource,\n  case\n    when arn is null then 'skip'\n    when all_user_grants \u003e 0 then 'alarm'\n    when auth_user_grants \u003e 0 then 'alarm'\n    when anon_statements \u003e 0 then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when arn is null then name || ' not found in account ' || account_id || '.'\n    when all_user_grants \u003e 0 then name || ' grants access to AllUsers in ACL.'\n    when auth_user_grants \u003e 0 then name || ' grants access to AuthenticatedUsers in ACL.'\n    when anon_statements \u003e 0 then name || ' grants access to AWS:*\" in bucket policy.'\n    else name || ' does not grant anonymous access in ACL or bucket policy.'\n  end as reason\n  \n  , region, account_id\nfrom\n  public_bucket_data;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "category": [
      "Compliance"
    ],
    "cis": [
      "true"
    ],
    "cis_item_id": [
      "2.3"
    ],
    "cis_level": [
      "1"
    ],
    "cis_section_id": [
      "2"
    ],
    "cis_type": [
      "scored"
    ],
    "cis_version": [
      "v1.2.0"
    ],
    "plugin": [
      "aws"
    ],
    "service": [
      "AWS/CloudTrail"
    ],
    "x-kaytu-explanation": [
      "```markdown\n# Amazon Web Service (AWS) Control: CloudTrail Logs\n\n**CloudTrail** on AWS records every **API call** made in your AWS account. These records are stored as __log files__ in an **Amazon S3 Bucket**. \n\nRecommended control for CloudTrail is to implement a __bucket policy__ or __access control list (ACL)__. These security measures aim to prevent public access to the CloudTrail logs. Public access could reveal sensitive information about your AWS environment. Thus, an appropriately configured bucket policy or access control list is a key component to securing your CloudTrail logs. \n\nIt's important to review bucket policies regularly and adjust as necessary to maintain a high level of security.\n```"
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance with this AWS control can result in the following potential costs:\n\n1. **Security Vulnerabilities**: If the S3 bucket that stores CloudTrail logs is publicly accessible, bad actors could gain unwarranted access to sensitive information about your AWS environment. This includes details about the API calls made, the source IP addresses, and the identities of API callers, among other things. \n\n2. **Data Breach**: Confidential log data could be leaked on the internet, potentially leading to substantial financial penalties, loss of customer trust, and reputational damage. \n\n3. **Unauthorized changes or Deletion**: A public S3 bucket can be manipulated by anyone having its URL. An unauthorized user can delete important logs files or alter them, causing loss of audit trail and accountability. \n\n4. **Violation of Compliance Requirements**: Depending on the industry and the jurisdiction of operation, non-compliance with strict data access and storage controls can lead to violations of various compliance requirements such as GDPR, HIPAA, etc. Substantial fines and penalties can be a result of such violations. \n\n5. **Operational Disruption**: Unauthorized access to the AWS CloudTrail logs may can lead to false trail records or disruption in the logging service, giving rise to operational inefficiencies. \n\nIt's advisable to ensure that the bucket policy or ACL restricts public access to your S3 bucket where CloudTrail logs are stored to avoid these potential issues."
    ],
    "x-kaytu-usefulness-example": [
      "For example, you run a healthcare tech company that uses AWS services for hosting and managing patient data. You have certain applications running in your AWS account, where your developers or admins use AWS APIs to execute actions. \n\nTo ensure the security and privacy of patient data, you need to monitor who's accessing your AWS resources, when and how. By using AWS CloudTrail, you can keep track of all the API calls made in your AWS account. \n\nWith these log files stored in an S3 bucket, safeguarding access to this bucket is crucial. To accomplish this, you would configure your S3 bucket policy or ACL to prevent public access to your CloudTrail logs. This safeguards your logs which carry vital information about your infrastructure's interaction. If these logs fell into the wrong hands, malicious actors could scope out potential vulnerabilities in your system, leading to breaches or data loss.\n\nAWS S3 bucket policies helps you manage this access control. By rejecting public access to your logs, you are ensuring that only designated stakeholders (e.g., system administrators or security analysts) can access these logs. This preventative control greatly minimizes the risk of unauthorized access to critical system info. \n\nSo in this case, the AWS control to regulate public access to the S3 bucket storing your CloudTrail logs is extremely useful in enhancing the security posture of your AWS infrastructure. Without it, your logs, and the valuable insights it brings about your system, could become accessible to individuals who should not have access to them."
    ]
  },
  "Managed": true
}