{
  "ID": "aws_iam_user_console_access_mfa_enabled",
  "Title": "IAM users with console access should have MFA enabled",
  "Description": "Manage access to resources in the AWS Cloud by ensuring that MFA is enabled for all AWS Identity and Access Management (IAM) users that have a console password.",
  "Query": {
    "Connector": "AWS",
    "Engine": "odysseus-v0.0.1",
    "ListOfTables": [
      "aws_iam_credential_report"
    ],
    "PrimaryTable": "aws_iam_credential_report",
    "QueryToExecute": "select\n  user_arn as resource,\n  kaytu_account_id as kaytu_account_id,\n  kaytu_resource_id as kaytu_resource_id,\n  case\n    when password_enabled and not mfa_active then 'alarm'\n    else 'ok'\n  end as status,\n  case\n    when not password_enabled then user_name || ' password login disabled.'\n    when password_enabled and not mfa_active then user_name || ' password login enabled but no MFA device configured.'\n    else user_name || ' password login enabled and MFA device configured.'\n  end as reason\n  , account_id\nfrom\n  aws_iam_credential_report;\n"
  },
  "DocumentURI": "",
  "ManualVerification": false,
  "Severity": "high",
  "Tags": {
    "audit_manager_control_tower": [
      "true"
    ],
    "category": [
      "Compliance"
    ],
    "cis_controls_v8_ig1": [
      "true"
    ],
    "cisa_cyber_essentials": [
      "true"
    ],
    "fedramp_low_rev_4": [
      "true"
    ],
    "fedramp_moderate_rev_4": [
      "true"
    ],
    "ffiec": [
      "true"
    ],
    "gdpr": [
      "true"
    ],
    "gxp_21_cfr_part_11": [
      "true"
    ],
    "hipaa_final_omnibus_security_rule_2013": [
      "true"
    ],
    "hipaa_security_rule_2003": [
      "true"
    ],
    "nist_800_171_rev_2": [
      "true"
    ],
    "nist_800_53_rev_4": [
      "true"
    ],
    "nist_800_53_rev_5": [
      "true"
    ],
    "nist_csf": [
      "true"
    ],
    "pci_dss_v321": [
      "true"
    ],
    "plugin": [
      "aws"
    ],
    "service": [
      "AWS/IAM"
    ],
    "soc_2": [
      "true"
    ],
    "x-kaytu-explanation": [
      "Here is a markup (markdown) format description:\n\n```markdown\n# Amazon Web Services (AWS) Control \n\nAWS provides a service to manage access to resources in the AWS Cloud. To add an additional layer of security, it ensures that Multi-Factor Authentication (MFA) is enabled for all AWS Identity and Access Management (IAM) users who have a console password set. \n\n## Key Points: \n\n- __MFA__: This is a simple best practice that adds an extra layer of protection on top of your user name and password.\n\n- __IAM Users__: IAM lets you manage access to your AWS resources. Specifically, it enables you to create and manage AWS users and groups and use permissions to allow and deny their access to AWS resources.\n\n- __Console Password__: IAM users that have a console password can sign in to the AWS Management Console.\n\n```\nThis control aims to improve the security of AWS resources by mitigating the risk of unauthorized or malicious access."
    ],
    "x-kaytu-noncompliance-cost": [
      "Non-compliance to the control \"Manage access to resources in the AWS Cloud by ensuring that Multi-Factor Authentication (MFA) is enabled for all AWS Identity and Access Management (IAM) users that have a console password\" can come with several potential costs, some of which include:\n\n**1. Security Risks:** Without MFA, if a user's primary credentials (username \u0026 password) are compromised, the intruder will have full access to your cloud resources. MFA adds an additional layer of security to prevent such breaches.\n\n**2. Financial Impact:** A breach could lead to unauthorized activities, such as launching of large EC2 instances or creation of other resources, causing unwanted financial expenditure.\n\n**3. Data Loss:** If MFA is not enabled, the risk of data loss due to malicious activities increases, which could lead to a loss of key business data.\n\n**4. Regulatory Fines:** For organizations operating under regulatory compliances such as GDPR, HIPAA, PCI-DSS, etc., non-compliance may lead to hefty fines.\n\n**5. Reputational Damage:** In case of a breach, an organization's reputation can be severely damaged, leading to loss of customer trust.\n\n**6. Remediation Costs:** Once a breach has happened, the corresponding remediation processes and the associated costs like forensic analysis, additional security measures implementation etc. can further add to the financial burden.\n\nThus, not enabling MFA for all AWS IAM users with a console password can lead to significant financial and non-financial costs, underscoring the importance of complying with this control."
    ],
    "x-kaytu-usefulness-example": [
      "AWS provides Multi-Factor Authentication (MFA) which adds an extra layer of protection on user's AWS accounts and operations. Enabling this feature for IAM users that have console password can prove extremely useful in several scenarios. \n\nFor instance, let's consider a scenario where your company has a large team of developers who constantly need to access and modify AWS resources for various projects. If one of those users' credentials were to be compromised, an unauthorized entity could potentially gain access to sensitive company data or tamper with your AWS resources, leading to potential data breaches or service interruptions.\n\nWith an MFA enabled, even if a user's basic access credentials were compromised, unauthorized users would still be unable to access AWS resources without the second authentication factor - usually a temporary code delivered through a hardware MFA device or a mobile application. This significantly reduces the risk of unauthorized access, providing a stronger security level for your AWS operations.\n\nEnable MFA can also be essential for meeting certain industry-specific cybersecurity standards and regulations. For instance, companies that handle credit card payments may need to demonstrate they have such measures in place to comply with Payment Card Industry Data Security Standards (PCI DSS)."
    ]
  },
  "Managed": true
}